{
  "backend/main.mo": "Main Motoko actor for the app, defining data types (UserProfile, Place, Route, EmergencyProfile, SOS, Meetup, ActivityLog) and state maps, with mixins for blob storage and authorization/access control.",
  "feature_evidence.json": "Feature evidence report documenting the end-to-end admin promotion flow fix, listing the affected frontend files and component dependencies with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing the purpose and key changes for each component, hook, page, and utility.",
  "frontend/docs/flyer-download-smoke-test.md": "Manual smoke-test checklist for flyer download and sharing functionality, covering direct download, auto-export, link sharing, error handling, and quick share across desktop and mobile browsers.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "HTML entry point for the React app titled 'My Brother's Keeper', mounting the app into a root div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with all public, authenticated, and admin routes wrapped in appropriate guards, plus QueryClientProvider, ThemeProvider, and AdminPromotionHandler.",
  "frontend/src/components/AdminPromotionHandler.tsx": "Invisible component that reads a stored admin token after login and calls the promoteToAdmin mutation once the actor is ready, then clears the token and shows a toast with the result.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI card shown when a non-admin user tries to access an admin page, with buttons to navigate home or to the places list.",
  "frontend/src/components/auth/AdminAccessDialog.tsx": "A dialog component that allows users to enter an admin token to gain administrator privileges, handling both authenticated and unauthenticated states by saving the token before login redirect if needed.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "A route guard component that checks if the current caller has admin privileges and renders either a loading spinner, an access denied screen, or the protected children accordingly.",
  "frontend/src/components/auth/AuthenticatedRouteGuard.tsx": "A route guard that protects pages requiring authentication, showing a loading state during initialization or a login prompt card if the user is not authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "A button component that handles Internet Identity login and logout, clearing the React Query cache on logout and retrying login if the user is already authenticated.",
  "frontend/src/components/layout/AppLayout.tsx": "The main application layout component providing a sticky header, a responsive sidebar (desktop) and sheet menu (mobile) for authenticated users, a main content area, and a footer.",
  "frontend/src/components/layout/AppNav.tsx": "A navigation component rendering links to main app sections and conditionally showing an Admin Dashboard link for authenticated admin users.",
  "frontend/src/components/layout/BrandHeader.tsx": "The sticky top header displaying the app logo, emergency lookup button, admin access button, share button, and login/logout button.",
  "frontend/src/components/maps/MapZoomControl.tsx": "A settings control component that lets users select and persist their preferred map zoom level via a dropdown, stored using a zoom preference utility.",
  "frontend/src/components/profile/EmergencyAccessCodeCard.tsx": "A profile card component that generates, displays, copies, and rotates a local emergency access code, and shows the user's Principal ID for use in emergency lookups.",
  "frontend/src/components/profile/EmergencyProfileCard.tsx": "A form card component that allows users to save emergency profile information (next of kin and health conditions) tied to their stored access code, using a mutation hook to persist the data.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A modal dialog that appears for authenticated users who have no profile yet, prompting them to enter their name to create an initial user profile.",
  "frontend/src/components/profile/VerificationUploadsCard.tsx": "A card component that lets users upload trucking license and ID proof documents for verification, displaying upload progress and current verification status (Not Submitted, Pending Review, or Approved).",
  "frontend/src/components/share/FlyerPreview.tsx": "A forwardRef presentational component that renders a styled recruitment flyer for the app, displaying feature highlights and a shareable URL passed as a prop.",
  "frontend/src/components/share/ShareDialog.tsx": "A dialog component that provides options to share the app via native share, copy link to clipboard, view a flyer page, or download a flyer, navigating to the flyer route as needed.",
  "frontend/src/components/sos/LastKnownLocationCard.tsx": "A card that displays a one-time SOS location snapshot (coordinates and timestamp) with a Google Maps link, or a fallback message if no snapshot exists.",
  "frontend/src/components/sos/PublicSOSCardView.tsx": "A public-facing emergency information view for first responders that shows driver name, next of kin, health conditions, and last known location using the LastKnownLocationCard component.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) actors, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient and exposing identity, login status, and helper flags to child components.",
  "frontend/src/hooks/useQrCodeCanvas.ts": "React hook that generates a QR code onto a provided canvas element, tracking generation status (idle/generating/ready/error) with abort support and a 3-second safety timeout.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for all backend interactions including user profiles, admin operations, places, routes, emergency profiles, and meetup locations using the useActor hook.",
  "frontend/src/index.css": "Global CSS file that configures Tailwind base/components/utilities and defines CSS custom properties for a light (asphalt/high-visibility) and dark (night highway) theme, plus two utility component classes.",
  "frontend/src/lib/accessCode.ts": "Utility module for generating, storing, retrieving, and clearing a 12-character emergency access code in localStorage.",
  "frontend/src/lib/adminPromotion.ts": "Utility module for managing an admin token across Internet Identity login redirects, supporting save/retrieve/clear in localStorage and extraction from URL hash parameters.",
  "frontend/src/lib/clipboard.ts": "Resilient clipboard copy utility that tries the modern Clipboard API first and falls back to a deprecated execCommand approach, returning a boolean success indicator without throwing.",
  "frontend/src/lib/domToPng.ts": "Empty file with no content.",
  "frontend/src/lib/eventType.ts": "Provides a label-mapping function and an options array for all backend EventType enum values, used for display and filtering in the UI.",
  "frontend/src/lib/fileValidation.ts": "Validates uploaded files against a 10MB size limit and an allowlist of MIME types (JPEG, PNG, WebP, PDF), and provides a file size formatting helper.",
  "frontend/src/lib/flyerExport.ts": "Exports a flyer component as a PNG image by manually rendering its content onto an HTML canvas, including gradient background, text, and QR code elements.",
  "frontend/src/lib/geolocation.ts": "Wraps the browser Geolocation API in a promise-based function that returns latitude/longitude or rejects with a descriptive error message.",
  "frontend/src/lib/googleMapsUrl.ts": "Builds a Google Maps URL from latitude, longitude, and an optional zoom level.",
  "frontend/src/lib/mapZoomPreference.ts": "Persists and retrieves a map zoom level preference in localStorage, clamping values between 1 and 21 with a default of 15.",
  "frontend/src/lib/meetupShareCode.ts": "Generates, stores, retrieves, and clears a random 8-character meetup share code using localStorage.",
  "frontend/src/lib/placeCategory.ts": "Provides display labels and option arrays for the PlaceCategory enum, plus a helper to get a category's label string.",
  "frontend/src/lib/principal.ts": "Provides utilities to validate, safely parse, and convert Principal ID strings using the @dfinity/principal library.",
  "frontend/src/lib/qr.ts": "Empty file with no content.",
  "frontend/src/lib/qrCodeGenerator.ts": "Implements a standards-compliant QR code generator (ISO/IEC 18004) with Reed-Solomon error correction, Galois field arithmetic, and canvas rendering support.",
  "frontend/src/lib/qrDownload.ts": "Downloads an HTML canvas element as a PNG file by converting it to a Blob and triggering a link click, with validation for canvas readiness.",
  "frontend/src/lib/quickShare.ts": "Attempts to share a URL via the Web Share API and falls back to clipboard copy, returning a typed result indicating the outcome.",
  "frontend/src/lib/shareUrl.ts": "Returns the canonical absolute share URL for the application using window.location.origin.",
  "frontend/src/lib/time.ts": "Provides conversion utilities between JavaScript Date objects and nanosecond bigint timestamps, plus locale-aware date/time formatting functions.",
  "frontend/src/lib/urlParams.ts": "Provides utilities to get and remove URL parameters from both standard query strings and hash-based routing without triggering a page reload.",
  "frontend/src/main.tsx": "Entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AddPlacePage.tsx": "A form page for authenticated users to add a new safe place, collecting name, category, location, and description fields, then submitting via the useAddPlace mutation.",
  "frontend/src/pages/AddRoutePage.tsx": "A form page for authenticated users to create and share a new route with start, destination, optional waypoints, date/time, and notes fields, submitted via the useCreateRoute mutation.",
  "frontend/src/pages/AdminDashboardPage.tsx": "An admin-only dashboard with tabbed views for registrations, verification reviews, SOS locations, and activity logs, using multiple data-fetching hooks and guarded by AdminRouteGuard.",
  "frontend/src/pages/AdminReviewPage.tsx": "An empty file with no content or exports.",
  "frontend/src/pages/EmergencyLookupPage.tsx": "A public page that allows emergency responders to look up a driver's emergency profile and SOS snapshot by entering their Principal ID and Emergency Access Code.",
  "frontend/src/pages/FlyerPage.tsx": "A page that displays a shareable app flyer preview with options to copy the share link or download the flyer as a PNG, supporting an auto-export query parameter trigger.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page for MBK Riders that displays hero section, feature highlights, and navigation buttons; redirects authenticated users to /places and includes an admin access dialog entry point.",
  "frontend/src/pages/MeetupPage.tsx": "Page for sharing and looking up real-time meetup locations; allows authenticated users to broadcast their GPS position with a share code and look up other riders' locations by principal ID or code.",
  "frontend/src/pages/PlaceDetailPage.tsx": "Detail view for a single safe place, looked up by URL-encoded name from the places list; displays location, description, category badge, and submitter principal.",
  "frontend/src/pages/PlacesListPage.tsx": "Searchable, filterable list of community-submitted safe places with category select and text search; authenticated users can navigate to the add-place form.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page showing principal ID, verification status, admin badge, and sub-cards for verification uploads, emergency profile, and emergency access code.",
  "frontend/src/pages/RouteDetailPage.tsx": "Placeholder route detail page that only renders a back button and a stub message with no real content yet.",
  "frontend/src/pages/RoutesListPage.tsx": "Tabbed routes page showing the current user's shared routes and a lookup tab to search routes by principal ID; includes a RouteCard component and links to the add-route form.",
  "frontend/src/pages/SOSCardPage.tsx": "Displays the authenticated user's emergency SOS card by looking up their emergency profile using their principal and stored access code, showing a loading state or a setup prompt if data is unavailable.",
  "frontend/src/pages/SOSPage.tsx": "Provides an emergency SOS page where authenticated users can capture their current GPS location as a one-time snapshot and navigate to view their SOS card.",
  "frontend/src/pages/UserAccountDetailsPage.tsx": "Admin-only page that displays detailed account information for a specific user (identified by Principal ID), including profile, emergency profile, routes, places, locations, and activity log.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH-based color tokens, border radii, animations, and plugins (typography, container-queries, animate) for the frontend design system.",
  "project_state.json": "Project state metadata tracking the current version, known issues (broken admin promotion flow), and existing feature requests focused on fixing end-to-end admin access."
}