{
  "backend/main.mo": "Main Motoko actor for the app defining all data types (UserProfile, Place, Route, EmergencyProfile, SOS, Meetup, etc.) and state maps; includes mixins for blob storage and authorization with a hardcoded bootstrap admin principal.",
  "feature_evidence.json": "Feature evidence report listing three high-confidence features to fix: AdminPromotionHandler loop, AdminRouteGuard infinite spinner/redirect, and useQueries cascade re-fetch — each mapped to specific files and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated summaries of all frontend source files describing the purpose and recent changes of each component, hook, page, and utility in the React frontend.",
  "frontend/docs/flyer-download-smoke-test.md": "Manual smoke-test checklist for flyer download and sharing functionality covering direct download, auto-export, link sharing, error handling, and quick share across desktop and mobile browsers.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML entry point titled 'My Brother's Keeper' that mounts the React app via a root div and loads the main TSX module.",
  "frontend/src/App.tsx": "Root React app file that configures TanStack Router with all public and authenticated routes, wraps the layout in BootstrapAdminProvider and QueryClientProvider, and includes AdminPromotionHandler in the root layout.",
  "frontend/src/components/admin/GenerateAdminTokenCard.tsx": "A card UI component that allows an existing admin to generate a one-time admin invitation token, display it, and copy it to the clipboard.",
  "frontend/src/components/AdminPromotionHandler.tsx": "A headless component that handles the stored-token admin promotion flow: after login, it reads a token from localStorage and calls promoteToAdmin, then navigates to the admin dashboard or shows an error toast.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "A simple full-page screen displayed when a user lacks admin privileges, offering navigation buttons to return home or browse safe places.",
  "frontend/src/components/auth/AdminAccessDialog.tsx": "A dialog that lets a user enter an admin token to gain admin privileges; if unauthenticated, it saves the token to localStorage before triggering Internet Identity login.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "A route guard component that shows a loading spinner while identity and admin status are being resolved, then renders children for admins or AccessDeniedScreen for non-admins.",
  "frontend/src/components/auth/AuthenticatedRouteGuard.tsx": "A route guard that shows a loading spinner during initialization, a login prompt if unauthenticated, or renders children when the user is logged in.",
  "frontend/src/components/auth/LoginButton.tsx": "A button component that triggers Internet Identity login or logout, clearing the React Query cache on logout.",
  "frontend/src/components/layout/AppLayout.tsx": "The main application shell providing a brand header, a responsive sidebar/mobile-sheet navigation (shown only when authenticated), a main content area, and a footer.",
  "frontend/src/components/layout/AppNav.tsx": "A navigation component rendering the main nav links and, conditionally for authenticated admins, an Admin Dashboard link with active-state highlighting.",
  "frontend/src/components/layout/BrandHeader.tsx": "Sticky top navigation header with logo, emergency lookup button, admin access dialog trigger, share dialog trigger, and login button.",
  "frontend/src/components/maps/MapZoomControl.tsx": "A settings control that reads and persists the user's preferred map zoom level via a select dropdown, affecting how Google Maps links open.",
  "frontend/src/components/profile/EmergencyAccessCodeCard.tsx": "Card component for generating, displaying, copying, and rotating a locally-stored emergency access code that paired with a Principal ID enables emergency profile lookup.",
  "frontend/src/components/profile/EmergencyProfileCard.tsx": "Form card for saving private emergency profile data (next of kin, health conditions) to the backend, requiring a stored access code.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Modal dialog that appears once for authenticated users without a profile, prompting them to enter their name to create an initial user profile.",
  "frontend/src/components/profile/VerificationUploadsCard.tsx": "Card for uploading trucking license and ID proof documents for admin verification, showing upload progress and current verification status badge.",
  "frontend/src/components/share/FlyerPreview.tsx": "A styled, printable flyer component that displays app branding, feature highlights, and a shareable URL for recruiting new truckers to the platform.",
  "frontend/src/components/share/ShareDialog.tsx": "A dialog component that lets users share the app via a URL, copy link to clipboard, use the native share API, or navigate to a flyer page for download.",
  "frontend/src/components/sos/LastKnownLocationCard.tsx": "Displays a card showing the last known GPS location from an SOS snapshot, including timestamp, coordinates, and a Google Maps link.",
  "frontend/src/components/sos/PublicSOSCardView.tsx": "Renders a public-facing emergency information view for first responders, showing the driver's emergency contacts, health conditions, and last known location.",
  "frontend/src/contexts/BootstrapAdminContext.tsx": "A no-op stub context for bootstrap admin promotion that previously tracked pending promotion state; now unused since the backend handles it directly.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQrCodeCanvas.ts": "A hook that generates a QR code onto a canvas element, tracking generation status and handling timeouts and abort logic for re-renders.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for all backend interactions including user profiles, admin checks, places, routes, emergency profiles, and member management.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for light ('Asphalt & High-Visibility Safety') and dark ('Night Highway') themes, plus utility component classes.",
  "frontend/src/lib/accessCode.ts": "Provides utilities to generate, store, retrieve, and clear a 12-character emergency access code persisted in localStorage.",
  "frontend/src/lib/adminPromotion.ts": "Handles saving, retrieving, clearing, and extracting admin promotion tokens from localStorage and URL hash parameters, including a helper to capture tokens on app initialization.",
  "frontend/src/lib/clipboard.ts": "Resilient clipboard copy utility that tries the modern Clipboard API first and falls back to a DOM-based execCommand approach, returning a boolean success indicator.",
  "frontend/src/lib/domToPng.ts": "Empty file with no content.",
  "frontend/src/lib/eventType.ts": "Maps backend EventType enum values to human-readable labels and exports both a label-getter function and a select-options array.",
  "frontend/src/lib/fileValidation.ts": "Validates uploaded files against a 10 MB size limit and an allowlist of MIME types (JPEG, PNG, WebP, PDF), and provides a file-size formatting helper.",
  "frontend/src/lib/flyerExport.ts": "Exports a flyer DOM element as a PNG by manually rendering its content onto an HTML canvas at 2× resolution, then triggering a file download.",
  "frontend/src/lib/geolocation.ts": "Wraps the browser Geolocation API in a Promise, returning latitude/longitude or a descriptive error message for common failure cases.",
  "frontend/src/lib/googleMapsUrl.ts": "Builds a Google Maps URL from latitude, longitude, and an optional zoom level.",
  "frontend/src/lib/mapZoomPreference.ts": "Persists and retrieves a map zoom level preference in localStorage, clamping values to the valid range of 1–21 with a default of 15.",
  "frontend/src/lib/meetupShareCode.ts": "Provides utilities to generate, store, retrieve, and clear an 8-character meetup share code persisted in localStorage.",
  "frontend/src/lib/placeCategory.ts": "Maps PlaceCategory enum values to display labels and exports a label-getter function and a select-options array.",
  "frontend/src/lib/principal.ts": "Provides helpers to validate, safely parse, and convert Principal ID strings using the @dfinity/principal library.",
  "frontend/src/lib/qr.ts": "Empty file with no content.",
  "frontend/src/lib/qrCodeGenerator.ts": "Implements a standards-compliant QR code generator (ISO/IEC 18004) with Reed-Solomon error correction, Galois field arithmetic, and support for versions 1–5 and all error correction levels.",
  "frontend/src/lib/qrDownload.ts": "Provides a utility function to download an HTML canvas element as a PNG file, with validation and clipboard-based fallback error handling.",
  "frontend/src/lib/quickShare.ts": "Implements a URL sharing helper that uses the Web Share API with a clipboard copy fallback, returning typed result statuses for toast messaging.",
  "frontend/src/lib/shareUrl.ts": "Exports a single function that returns the canonical absolute base URL of the application using window.location.origin.",
  "frontend/src/lib/time.ts": "Provides utility functions for converting between JavaScript Date objects and nanosecond bigint timestamps, plus locale-aware date/time formatting helpers.",
  "frontend/src/lib/urlParams.ts": "Provides utilities to get and remove URL parameters from both standard query strings and hash-based routing without triggering a page reload.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity authentication providers wrapping the root App component.",
  "frontend/src/pages/AddPlacePage.tsx": "A form page for authenticated users to submit a new safe place with name, category, location, and description fields, navigating back to the places list on success.",
  "frontend/src/pages/AddRoutePage.tsx": "A form page for authenticated users to create and share a planned truck route with start, destination, optional waypoints, date/time, and notes.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabbed views for user registrations, verification reviews, SOS locations, activity logs, and admin token generation, guarded by AdminRouteGuard.",
  "frontend/src/pages/AdminReviewPage.tsx": "File appears to be empty or truncated with no content provided.",
  "frontend/src/pages/EmergencyLookupPage.tsx": "A page that allows users to look up a driver's emergency information by entering their Principal ID and Emergency Access Code, then displays the resulting SOS profile and last known location.",
  "frontend/src/pages/FlyerPage.tsx": "A page that displays a shareable flyer preview with the app's share URL, supporting manual and auto-triggered PNG export/download and clipboard copy of the link.",
  "frontend/src/pages/LandingPage.tsx": "The public landing page showcasing MBK Riders' features with hero imagery, navigation buttons to key sections, and an admin access entry point; redirects authenticated users to the places page.",
  "frontend/src/pages/MeetupPage.tsx": "An authenticated page for sharing and updating the user's real-time meetup location and looking up other riders' locations via Principal ID and share code.",
  "frontend/src/pages/PlaceDetailPage.tsx": "Displays detailed information (name, category, location, description, submitter) for a single safe place looked up by URL param, with a back button to the places list.",
  "frontend/src/pages/PlacesListPage.tsx": "Lists all safe places with search and category filter controls, and provides an authenticated button to navigate to the add-place form.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the authenticated user's profile page including name, verification status, principal ID, and admin badge, with cards for verification uploads, emergency profile, and emergency access code.",
  "frontend/src/pages/RouteDetailPage.tsx": "Placeholder page for viewing a single route's details, with a back button navigating to the routes list.",
  "frontend/src/pages/RoutesListPage.tsx": "Shows a tabbed list of routes (user's own and searchable by principal), with route cards displaying start/destination/waypoints and a button to add new routes.",
  "frontend/src/pages/SOSCardPage.tsx": "Authenticated page that retrieves and displays the user's emergency SOS card using their stored access code, showing a public SOS card view or a setup prompt if no profile exists.",
  "frontend/src/pages/SOSPage.tsx": "Authenticated page allowing users to capture a one-time GPS location snapshot for emergency SOS purposes and navigate to their SOS card view.",
  "frontend/src/pages/UserAccountDetailsPage.tsx": "Admin-only page that displays comprehensive account details for a specific user (by principal ID), including profile, emergency profile, routes, places, locations, and activity log.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom OKLCH-based colors, border radii, accordion animations, and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current state of the MBK Riders web app project, documenting a persistent login-loop bug, three in-progress fix features (AdminPromotionHandler, AdminRouteGuard, useQueries), and one pending request to hardcode the bootstrap admin Principal ID in the backend."
}