{
  "backend/main.mo": "Main Motoko actor defining all core data types (UserProfile, Place, Route, EmergencyProfile, SOS, Meetup) and state maps, with mixins for blob storage and authorization, plus activity logging and query/update endpoints.",
  "backend/migration.mo": "Migration module that transforms the old actor state (which included a HARDCODED_ADMIN_PRINCIPAL field) into the new actor state shape by dropping that field and preserving all other maps and lists.",
  "feature_evidence.json": "Feature evidence report linking the admin token handling flow feature to its implementation files (AppNav, useQueries, adminPromotion) and associated test ID REQ-8.",
  "frontend-file-summaries.txt": "Auto-generated text file containing one-line summaries of each frontend source file, describing component responsibilities and notable changes.",
  "frontend/docs/flyer-download-smoke-test.md": "Manual smoke-test checklist for verifying flyer download, share dialog auto-export, link sharing, error handling, and quick share functionality across desktop and mobile browsers.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, sidebar, chart colors, etc.).",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'My Brother's Keeper' and mounting the app at the #root div.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes, wraps the app in ThemeProvider, and includes AdminPromotionHandler which automatically calls the admin promotion endpoint after Internet Identity authentication if a pending token is found.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays a centered card with a shield-alert icon and message when a user lacks admin permissions, with a button to navigate back to the home page.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard component that checks if the current user is an admin before rendering children, showing a loading spinner during checks and an AccessDeniedScreen if not authorized.",
  "frontend/src/components/auth/AuthenticatedRouteGuard.tsx": "Route guard that requires Internet Identity authentication, showing a login prompt card if the user is not logged in.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component that handles Internet Identity authentication, saves admin tokens before login redirects, and clears the query cache on logout.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with a sticky brand header, responsive sidebar navigation (desktop) and sheet-based mobile menu, a main content area, and a footer.",
  "frontend/src/components/layout/AppNav.tsx": "Navigation component rendering links to Places, Routes, Meetup, Profile, and conditionally an Admin Dashboard link if the current user is an admin.",
  "frontend/src/components/layout/BrandHeader.tsx": "Sticky top header displaying the app brand, a share dialog trigger, an emergency lookup link for unauthenticated users, and the login button.",
  "frontend/src/components/maps/MapZoomControl.tsx": "UI control for selecting and persisting a preferred map zoom level, stored via a mapZoomPreference utility and presented as a dropdown select.",
  "frontend/src/components/profile/EmergencyAccessCodeCard.tsx": "Profile card for generating, displaying, copying, and rotating a locally-stored emergency access code alongside the user's Principal ID.",
  "frontend/src/components/profile/EmergencyProfileCard.tsx": "Profile card form for saving next-of-kin and health condition information as a private emergency profile, requiring an access code to be generated first.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A modal dialog that appears for authenticated users without a profile, prompting them to enter their name and create a new user profile.",
  "frontend/src/components/profile/VerificationUploadsCard.tsx": "A card component that allows users to upload trucking license and ID proof documents for verification, displaying current verification status with upload progress tracking.",
  "frontend/src/components/share/FlyerPreview.tsx": "A forwardRef component that renders a styled promotional flyer for the app, displaying app description, features, and a shareable URL.",
  "frontend/src/components/share/ShareDialog.tsx": "A dialog component providing options to share the app via native share, copy link, view flyer, or download flyer, navigating to the flyer route as needed.",
  "frontend/src/components/sos/LastKnownLocationCard.tsx": "A card that displays a one-time GPS snapshot from an SOS event, showing coordinates, timestamp, and a Google Maps link.",
  "frontend/src/components/sos/PublicSOSCardView.tsx": "A public-facing emergency information view for first responders, showing the driver's emergency contacts, health conditions, and last known location.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, exposing login/logout functions, identity state, and login status derived from DFINITY's AuthClient.",
  "frontend/src/hooks/useQrCodeCanvas.ts": "React hook that generates a QR code onto a canvas element, tracking generation status (idle/generating/ready/error) with abort support and a 3-second safety timeout.",
  "frontend/src/hooks/useQueries.ts": "Centralizes TanStack Query hooks for backend data fetching and mutations, covering user profiles, admin roles, verification uploads, places, routes, and other canister operations.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for a light 'Asphalt & High-Visibility Safety' theme and a dark 'Night Highway' theme, plus utility component classes.",
  "frontend/src/lib/accessCode.ts": "Utility functions for generating, storing, retrieving, and clearing a 12-character emergency access code persisted in localStorage.",
  "frontend/src/lib/adminPromotion.ts": "Utilities for persisting and retrieving a caffeineAdminToken across Internet Identity redirects using localStorage, including URL hash extraction and cleanup.",
  "frontend/src/lib/clipboard.ts": "Resilient clipboard copy utility that tries the modern Clipboard API first and falls back to a deprecated execCommand approach, returning a boolean success indicator.",
  "frontend/src/lib/domToPng.ts": "Empty file with no content.",
  "frontend/src/lib/eventType.ts": "Maps backend EventType enum values to human-readable labels and exports a pre-built options array for use in UI select components.",
  "frontend/src/lib/fileValidation.ts": "Validates uploaded files against a 10 MB size limit and an allowlist of MIME types (JPEG, PNG, WebP, PDF), and provides a file size formatter.",
  "frontend/src/lib/flyerExport.ts": "Exports a flyer component as a PNG image by manually rendering its content onto an HTML canvas, including gradient background, text, and QR code elements.",
  "frontend/src/lib/geolocation.ts": "Wraps the browser Geolocation API in a Promise, returning latitude/longitude or a descriptive error message on failure.",
  "frontend/src/lib/googleMapsUrl.ts": "Builds a Google Maps URL from latitude, longitude, and an optional zoom level.",
  "frontend/src/lib/mapZoomPreference.ts": "Persists and retrieves a map zoom level preference in localStorage, clamping values between 1 and 21 with a default of 15.",
  "frontend/src/lib/meetupShareCode.ts": "Generates, stores, retrieves, and clears a random 8-character meetup share code using localStorage.",
  "frontend/src/lib/placeCategory.ts": "Provides display labels and option arrays for the PlaceCategory enum, plus a helper to get a category's label string.",
  "frontend/src/lib/principal.ts": "Provides utilities to validate, parse, and safely convert strings to DFINITY Principal objects.",
  "frontend/src/lib/qr.ts": "Empty file with no content.",
  "frontend/src/lib/qrCodeGenerator.ts": "Implements a standards-compliant QR code generator (ISO/IEC 18004) with Reed-Solomon error correction, Galois field arithmetic, and canvas rendering.",
  "frontend/src/lib/qrDownload.ts": "Downloads a canvas element as a PNG file by converting it to a Blob and triggering a link click, with validation for canvas readiness.",
  "frontend/src/lib/quickShare.ts": "Attempts to share a URL via the Web Share API and falls back to clipboard copy, returning a typed result indicating the outcome.",
  "frontend/src/lib/shareUrl.ts": "Returns the canonical absolute share URL for the application using window.location.origin.",
  "frontend/src/lib/time.ts": "Provides conversion and formatting utilities between JavaScript Date objects and nanosecond bigint timestamps used by the ICP backend.",
  "frontend/src/lib/urlParams.ts": "Provides utilities to get and remove URL parameters from both standard query strings and hash-based routing without reloading the page.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AddPlacePage.tsx": "Form page for adding a new safe place with fields for name, category, location, and description. Requires authentication and navigates back to /places on success.",
  "frontend/src/pages/AddRoutePage.tsx": "Form page for creating and sharing a new route with start, destination, waypoints, date/time, and notes fields. Requires authentication and redirects to /routes on success.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard with tabbed views for registrations, verification reviews, SOS locations, and activity logs, restricted to admin users. Includes search, status badges, and verification approval/rejection actions.",
  "frontend/src/pages/AdminReviewPage.tsx": "Empty file with no content.",
  "frontend/src/pages/EmergencyLookupPage.tsx": "Public page allowing emergency responders to look up a driver's emergency info by entering a Principal ID and Emergency Access Code. Displays SOS snapshot and last known location on successful lookup.",
  "frontend/src/pages/FlyerPage.tsx": "Page that displays a shareable app flyer preview with options to copy the share link or download the flyer as a PNG. Supports auto-export via a URL query parameter on load.",
  "frontend/src/pages/LandingPage.tsx": "Landing page for the 'My Brother's Keeper' app that displays a hero section and feature grid for truck driver safety tools, redirecting authenticated users to the places page.",
  "frontend/src/pages/MeetupPage.tsx": "Page allowing authenticated truckers to share their real-time GPS location and look up other drivers' meetup locations using a principal ID and share code.",
  "frontend/src/pages/PlaceDetailPage.tsx": "Detail view for a single safe place, displaying its name, category, location, description, and submitter, looked up by URL param from the places list.",
  "frontend/src/pages/PlacesListPage.tsx": "Searchable, filterable list of community-submitted safe places with category selection, and a button for authenticated users to add new places.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page showing account info, verification status, principal ID, and sub-cards for verification uploads, emergency profile, and emergency access code.",
  "frontend/src/pages/RouteDetailPage.tsx": "Placeholder route detail page with a back button navigating to the routes list.",
  "frontend/src/pages/RoutesListPage.tsx": "Tabbed routes page showing the current user's shared routes and a lookup tab to search routes by another driver's principal ID, with add-route navigation.",
  "frontend/src/pages/SOSCardPage.tsx": "Displays the authenticated user's emergency SOS card by looking up their emergency profile using their principal and stored access code, showing a loading state or a prompt to set up a profile if none exists.",
  "frontend/src/pages/SOSPage.tsx": "Provides an emergency SOS page where authenticated users can capture their current GPS location as a one-time snapshot and navigate to view their SOS card.",
  "frontend/src/pages/UserAccountDetailsPage.tsx": "Admin-only page that displays detailed account information for a specific user (identified by Principal ID URL param), including profile, emergency profile, routes, places, locations, and activity log.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom OKLCH-based color tokens, border radius, box shadow, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the current project state at version 7, documenting known issues around Principal ID character limits and admin token access, existing fix features, and the architectural note that admin access should be bootstrapped by the first user presenting a valid admin token."
}