{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Allow first admin token user to become admin automatically",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Implement automatic admin promotion flow when user signs in with admin token in URL",
      "acceptanceCriteria": [
        "When a user visits the app with #caffeineAdminToken=<token> in the URL and completes Internet Identity sign-in, the frontend detects the token and calls the backend promotion endpoint.",
        "If the backend responds with a successful promotion, the Admin Dashboard navigation link becomes visible without a manual page reload.",
        "If the backend rejects the promotion (admin already set or invalid token), the app continues normally without showing an error to the user.",
        "The admin token is removed from the URL hash after the promotion attempt to avoid repeated calls on subsequent navigations."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/adminPromotion.ts",
          "operation": "modify",
          "description": "Implement utility functions to detect, extract, and clear the caffeineAdminToken from URL hash parameters. Provide a function that attempts admin promotion by calling the backend with the token, returning success/failure status. Use the existing urlParams utility (frontend/src/lib/urlParams.ts) for reading and clearing hash parameters."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query mutation hook (usePromoteToAdmin) that calls the backend assignCallerUserRole method with the admin role and accepts an admin token parameter. Configure the mutation to invalidate the 'callerRole' query key on success so that useIsCallerAdmin and related components re-fetch the updated role immediately."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Add an AdminPromotionHandler component or effect that runs after Internet Identity authentication completes. When the user authenticates and an identity is present, check for the caffeineAdminToken in the URL hash. If found, call the usePromoteToAdmin mutation with the token, then clear the token from the URL regardless of success or failure. Ensure this logic runs only once per authentication session to avoid repeated promotion attempts."
        },
        {
          "path": "frontend/src/components/layout/AppNav.tsx",
          "operation": "modify",
          "description": "Verify that the Admin Dashboard link already uses useIsCallerAdmin hook and will automatically appear when the query returns true. No changes required if already implemented correctly; otherwise, ensure the navigation component reactively displays the admin link based on the live query result without requiring a page reload."
        }
      ]
    }
  ]
}