{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin auth loop — remove gate logic and hardcode bootstrap admin Principal ID",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Fix AdminPromotionHandler to prevent navigation and re-initialization loops",
      "acceptanceCriteria": [
        "Mounting AdminPromotionHandler when no token is stored in localStorage causes zero navigation events",
        "No redirect loop occurs after login when the user is the hardcoded bootstrap admin",
        "The component runs its effect at most once per login session (guarded by a ref or stable dependency)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminPromotionHandler.tsx",
          "operation": "modify",
          "description": "Remove the silent bootstrap auto-promotion attempt that triggers when no token is present. The component should only handle token-based promotion (when a token exists in localStorage). Add a useRef guard to ensure the effect runs at most once per mount. Remove any navigation calls that trigger app re-initialization. The component must be a no-op when the caller is already admin or when no promotion token exists."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Fix AdminRouteGuard to resolve admin status without looping",
      "acceptanceCriteria": [
        "AdminRouteGuard settles (shows children or access denied) within one successful actor query",
        "Loading spinner is shown only while the query is in-flight, never indefinitely",
        "No navigation away from the admin route occurs when the caller is the hardcoded bootstrap admin"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Refactor the guard to use a single consolidated loading state from useActor and useIsCallerAdmin. Ensure the loading spinner is shown only while identity/actor are initializing OR while the admin query is fetching. Once the query settles, render either children (if admin) or AccessDeniedScreen (if not admin) — never navigate away. Remove any redirect logic that sends users back to the landing page or initialization flow. Verify that the guard does not trigger actor/identity re-initialization."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Audit and fix useQueries to prevent cascade re-fetches and identity restarts",
      "acceptanceCriteria": [
        "The admin status query is fetched once after actor is available and does not trigger further identity/actor re-initialization",
        "No circular query invalidation exists between actor, identity, and admin status hooks"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review useIsCallerAdmin and any related query hooks. Ensure the query is enabled only when actor is available and not fetching (enabled: !!actor && !actorFetching). Remove any query invalidation logic that triggers actor or identity re-initialization. Verify that the queryKey for admin status does not depend on unstable references. Ensure the query uses a stable actor reference and does not cause a cascade of re-fetches. Add retry: false to prevent automatic retries that could amplify loop behavior."
        }
      ]
    }
  ]
}