{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin access/promotion flow",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Diagnose and fix the end-to-end admin promotion flow so users with valid admin tokens gain admin privileges reliably",
      "acceptanceCriteria": [
        "A user can open the AdminAccessDialog, enter a valid admin token, and be promoted to admin after authenticating via Internet Identity",
        "If already logged in, entering a valid token in AdminAccessDialog immediately promotes the user without requiring re-login",
        "After successful promotion, the user can access admin-protected routes (e.g., /admin dashboard) without seeing the AccessDeniedScreen",
        "AdminPromotionHandler correctly reads the stored token post-redirect, calls promoteToAdmin, and clears the token from localStorage regardless of outcome",
        "Backend promoteToAdmin returns a success variant for a valid token",
        "If an invalid token is used, the user sees an appropriate error toast and is not promoted"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/adminPromotion.ts",
          "operation": "modify",
          "description": "Review and fix token persistence logic to ensure admin tokens survive Internet Identity login redirects. Verify storeAdminToken, getStoredAdminToken, and clearStoredAdminToken functions use a consistent localStorage key and handle edge cases (empty strings, whitespace). Ensure extractAdminTokenFromUrl correctly reads tokens from URL hash parameters and returns null when absent."
        },
        {
          "path": "frontend/src/components/auth/AdminAccessDialog.tsx",
          "operation": "modify",
          "description": "Fix token submission flow to ensure the token is persisted to localStorage before redirect if the user is not authenticated. For authenticated users, immediately call promoteToAdmin mutation. Add validation to prevent empty or whitespace-only tokens from being submitted. Ensure the dialog closes and shows appropriate loading/success states. Add error handling for mutation failures with user-friendly toast messages."
        },
        {
          "path": "frontend/src/components/AdminPromotionHandler.tsx",
          "operation": "modify",
          "description": "Fix post-login token handling to reliably retrieve the stored admin token, call promoteToAdmin mutation, and unconditionally clear the token from localStorage after the attempt (success or failure). Ensure the component runs only once per identity change and handles all PromoteToAdminResult variants (success, invalidToken, tokenExpired, accountAlreadyAdmin) with appropriate toast notifications. Verify the component does not trigger redundant promotion attempts."
        },
        {
          "path": "frontend/src/components/auth/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Review admin check logic to ensure it correctly reflects updated admin status after successful promotion. Verify the useIsCallerAdmin query is properly invalidated when admin status changes. Add proper loading state handling to prevent race conditions where stale admin status causes incorrect access denial. Ensure the guard re-evaluates admin status when identity or query data changes."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review usePromoteToAdmin mutation to ensure it correctly calls the backend promoteToAdmin method and handles all result variants. Add proper query invalidation for 'isAdmin' and 'userRole' queries after successful promotion to force AdminRouteGuard to re-check access. Verify mutation onSuccess callback triggers appropriate cache updates and UI state refreshes."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add debugging or error boundary to capture cases where users reach the admin dashboard without proper admin status. Ensure the page gracefully handles edge cases where admin checks pass the guard but backend queries fail authorization. Verify all data-fetching hooks handle unauthorized errors appropriately."
        }
      ]
    }
  ]
}