{
  "backend/main.mo": "Defines actor with storage, authorization mixins and CRUD logic for user profiles, places, routes, emergency data, and admin‑restricted profile listing.",
  "feature_evidence.json": "Lists feature evidence entries linking features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/docs/flyer-download-smoke-test.md": "Manual smoke‑test checklist for verifying flyer download and share functionality.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables and base styling for light and dark modes.",
  "frontend/index.html": "Basic HTML template loading the React root and main entry script.",
  "frontend/src/App.tsx": "Main app router configuration defining all routes, layout integration, and app initialization handling.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access‑denied message with navigation back to the home page.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects admin‑only pages by checking user role and showing an access‑denied screen when unauthorized.",
  "frontend/src/components/auth/AuthenticatedRouteGuard.tsx": "Guards routes requiring login and shows an Internet Identity login prompt if unauthenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity, handling auth state, loading, and retry logic.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, sidebar or mobile menu, content area, and footer, showing navigation only when authenticated.",
  "frontend/src/components/layout/AppNav.tsx": "Renders navigation buttons, highlights the active route, and conditionally shows admin links based on user role.",
  "frontend/src/components/layout/BrandHeader.tsx": "Displays the top header with branding, share button, emergency lookup link, and login button.",
  "frontend/src/components/profile/EmergencyAccessCodeCard.tsx": "Manages generating, viewing, copying, and rotating the user's emergency access code and shows their principal ID.",
  "frontend/src/components/profile/EmergencyProfileCard.tsx": "Form for creating or updating the user's emergency profile, requiring an access code and saving medical and contact info.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Prompts new authenticated users without a profile to enter their name and create an initial profile.",
  "frontend/src/components/profile/VerificationUploadsCard.tsx": "Handles file selection, validation, and upload of license and ID documents with progress tracking and status badges.",
  "frontend/src/components/share/FlyerPreview.tsx": "Renders a printable/shareable flyer preview containing platform info and the share URL.",
  "frontend/src/components/share/ShareDialog.tsx": "Displays a dialog for generating, copying, sharing, and navigating to a flyer for the app share URL.",
  "frontend/src/components/sos/PublicSOSCardView.tsx": "Shows emergency contact info and last known SOS location for first responders, with map links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity persistence using AuthClient.",
  "frontend/src/hooks/useQrCodeCanvas.ts": "Generates QR codes on a canvas with abort support, error handling, and readiness tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, roles, verification, admin profile lists, and place search using an actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles and light/dark theme CSS variables for an asphalt safety-themed UI.",
  "frontend/src/lib/accessCode.ts": "Generates, stores, retrieves, and clears a 12‑character access code in localStorage.",
  "frontend/src/lib/clipboard.ts": "Implements a resilient clipboard copy utility with secure-context checks and a DOM-based fallback.",
  "frontend/src/lib/domToPng.ts": "Empty placeholder file for DOM‑to‑PNG functionality.",
  "frontend/src/lib/fileValidation.ts": "Validates file type and size and formats byte sizes into human-readable strings.",
  "frontend/src/lib/flyerExport.ts": "Renders a flyer DOM element to a high‑resolution PNG using manual canvas drawing.",
  "frontend/src/lib/geolocation.ts": "Wraps browser geolocation in a Promise and returns coordinates with detailed error messages.",
  "frontend/src/lib/placeCategory.ts": "Maps backend place categories to labels and generates selection options.",
  "frontend/src/lib/qr.ts": "Empty placeholder file for QR helpers.",
  "frontend/src/lib/qrCodeGenerator.ts": "Implements a standards‑compliant QR code generator with Reed‑Solomon error correction and module layout.",
  "frontend/src/lib/qrDownload.ts": "Provides a utility to download a canvas element as a PNG with validation and error handling.",
  "frontend/src/lib/quickShare.ts": "Implements URL sharing using the Web Share API with clipboard fallback and detailed status results.",
  "frontend/src/lib/shareUrl.ts": "Returns the app’s canonical absolute share URL based on window.location.origin.",
  "frontend/src/lib/time.ts": "Provides bigint-based time conversions and formatting helpers.",
  "frontend/src/lib/urlParams.ts": "Adds helpers to get and clear URL parameters for both query and hash-based routing.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AddPlacePage.tsx": "Form page allowing authenticated users to create a new place listing with category, location, and description.",
  "frontend/src/pages/AddRoutePage.tsx": "Form page for creating a travel route with start, destination, waypoints, date/time, and notes.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard for viewing user registrations and reviewing verification requests.",
  "frontend/src/pages/AdminReviewPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/EmergencyLookupPage.tsx": "Allows lookup of a driver’s emergency info using Principal ID and Access Code for first responders.",
  "frontend/src/pages/FlyerPage.tsx": "Page that generates a shareable flyer, supports auto-export, manual download, and link copying using a preview ref.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page showing features and redirecting authenticated users to the places list.",
  "frontend/src/pages/PlaceDetailPage.tsx": "Displays details for a selected place, including location, category, description, and submitter info.",
  "frontend/src/pages/PlacesListPage.tsx": "Lists searchable and filterable safe places with category selection and an option to add new places.",
  "frontend/src/pages/ProfilePage.tsx": "Profile management page showing user info plus verification and emergency profile components.",
  "frontend/src/pages/RouteDetailPage.tsx": "Placeholder page for viewing details of a specific route.",
  "frontend/src/pages/RoutesListPage.tsx": "Lists user routes and allows searching routes by principal, with tabs for my routes and search results.",
  "frontend/src/pages/SOSCardPage.tsx": "Page showing the user's emergency SOS card, loading emergency data and rendering a public view or a setup prompt behind auth.",
  "frontend/src/pages/SOSPage.tsx": "Page for capturing a one‑time SOS location snapshot and linking to the SOS card, with geolocation and snapshot creation.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "JSON metadata describing current project features, state, feature requests, and admin dashboard plans."
}