{
  "backend/main.mo": "Motoko canister implementing user profiles, places, routes, emergency data, SOS snapshots, and access‑controlled CRUD operations with mixin-based storage and authorization.",
  "feature_evidence.json": "Feature evidence report listing flyer‑export related features, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-style mapping of many frontend file paths to short human-written summaries describing their purpose.",
  "frontend/docs/flyer-download-smoke-test.md": "Manual smoke‑test checklist for verifying flyer download, auto‑export, copy link, error handling, and regressions across browsers and devices.",
  "frontend/index.css": "Tailwind CSS base/theme variables and dark‑mode color definitions for global styling.",
  "frontend/index.html": "Basic HTML entry file mounting the React root and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, layout, and pages including flyer route with autoExportFlyer search validation.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Renders an access-denied message with an icon and a button to navigate home.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Checks if the user is an admin and shows loading or access denied screens before rendering children.",
  "frontend/src/components/auth/AuthenticatedRouteGuard.tsx": "Requires an authenticated identity and shows a login prompt if the user is not logged in.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button handling Internet Identity auth and query cache clearing.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, sidebar navigation, mobile menu, content area, and footer.",
  "frontend/src/components/layout/AppNav.tsx": "Navigation menu showing main app routes and admin options based on user role.",
  "frontend/src/components/layout/BrandHeader.tsx": "Top header with branding, share button, emergency lookup link, and login button.",
  "frontend/src/components/profile/EmergencyAccessCodeCard.tsx": "Manages creation, rotation, display, and copying of a user's emergency access code and principal ID.",
  "frontend/src/components/profile/EmergencyProfileCard.tsx": "Form for saving next-of-kin and health details, requiring an existing emergency access code.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog that prompts authenticated users without a profile to enter their name and create a new profile.",
  "frontend/src/components/profile/VerificationUploadsCard.tsx": "Card for uploading and validating license and ID files, showing upload progress and current verification status.",
  "frontend/src/components/share/FlyerPreview.tsx": "Flyer-style preview displaying branding, intro text, a QR code canvas, and the share URL.",
  "frontend/src/components/share/ShareDialog.tsx": "Dialog that generates a shareable URL and QR code with options to copy, share, or download the QR image.",
  "frontend/src/components/sos/PublicSOSCardView.tsx": "Public emergency info view showing driver details, contacts, health info, and last known SOS location with map link.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading stored identities and handling login state.",
  "frontend/src/hooks/useQrCodeCanvas.ts": "React hook that generates QR codes on a canvas with timeout protection and abort handling.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, verification, places, and related mutations using an actor API.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and global styles.",
  "frontend/src/lib/accessCode.ts": "Generates, stores, retrieves, and clears a 12‑character emergency access code in localStorage.",
  "frontend/src/lib/clipboard.ts": "Utility for copying text to the clipboard with secure-context checks and fallback methods.",
  "frontend/src/lib/domToPng.ts": "Empty file placeholder for DOM‑to‑PNG functionality.",
  "frontend/src/lib/fileValidation.ts": "Validates uploaded files for size and type and provides human-readable file size formatting.",
  "frontend/src/lib/flyerExport.ts": "Renders a flyer and QR canvas into a high-resolution PNG using manual canvas drawing.",
  "frontend/src/lib/geolocation.ts": "Wraps browser geolocation into a promise with detailed error messages.",
  "frontend/src/lib/placeCategory.ts": "Maps backend place categories to labels and provides helper utilities for category options.",
  "frontend/src/lib/qr.ts": "Empty QR-related module placeholder.",
  "frontend/src/lib/qrCodeGenerator.ts": "Implements a standards-based QR code generator with module setup, error correction, and data mapping.",
  "frontend/src/lib/qrDownload.ts": "Provides a function to download a canvas as a PNG with validation and error handling.",
  "frontend/src/lib/quickShare.ts": "Implements Web Share API sharing with clipboard fallback and detailed status results.",
  "frontend/src/lib/shareUrl.ts": "Returns the app’s canonical share URL based on window.location.origin.",
  "frontend/src/lib/time.ts": "Converts between Date and bigint timestamps and formats dates for display.",
  "frontend/src/lib/urlParams.ts": "Utilities for reading and clearing URL parameters in both query and hash-based routes.",
  "frontend/src/main.tsx": "Main React entry point setting up providers and rendering the App component.",
  "frontend/src/pages/AddPlacePage.tsx": "Form page for creating a new place with validation, mutation, and navigation.",
  "frontend/src/pages/AddRoutePage.tsx": "Form page for creating a route, converting date input, and submitting via mutation.",
  "frontend/src/pages/AdminReviewPage.tsx": "Admin interface for looking up users and approving or rejecting verification requests.",
  "frontend/src/pages/EmergencyLookupPage.tsx": "UI for entering a principal ID and access code to fetch and display emergency profile data, with loading and validation states.",
  "frontend/src/pages/FlyerPage.tsx": "Generates a shareable flyer with QR code, supports auto-export, manual download, and link copying.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen showing feature highlights and redirecting authenticated users to the places list.",
  "frontend/src/pages/PlaceDetailPage.tsx": "Displays detailed information for a selected place, including description, category, and submitter.",
  "frontend/src/pages/PlacesListPage.tsx": "Lists searchable and filterable safe places with an option to add new ones for authenticated users.",
  "frontend/src/pages/ProfilePage.tsx": "Profile management page showing user info plus verification uploads and emergency profile sections.",
  "frontend/src/pages/RouteDetailPage.tsx": "Placeholder page showing a simple route detail view with navigation back to the routes list.",
  "frontend/src/pages/RoutesListPage.tsx": "Displays the user's routes and allows searching routes by principal, with navigation to add new routes.",
  "frontend/src/pages/SOSCardPage.tsx": "Shows the user's emergency SOS card, loading emergency data and linking back to the SOS screen.",
  "frontend/src/pages/SOSPage.tsx": "Allows users to capture a one-time SOS location snapshot and navigate to view their SOS card.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Project metadata describing scope, issues, architectural notes, and implemented features."
}