{
  "backend/main.mo": "Main Motoko actor defining all backend types (UserProfile, Place, Route, EmergencyProfile, SOSSnapshot, MeetupLocation) and state maps, with public functions for user profiles, places, routes, emergency profiles, SOS snapshots, meetup locations, and admin operations including access control via MixinAuthorization and blob storage via MixinStorage.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: updating the Request Admin Access button to grant admin privileges immediately, and wiring the button to call the backend admin grant function with role refresh on success.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, hooks, pages, utilities, and route guards, with detailed descriptions of the admin access request flow, authentication guards, and UI components.",
  "frontend/docs/flyer-download-smoke-test.md": "Manual smoke test checklist for flyer download functionality covering direct download, share dialog auto-export, link sharing, error handling, and quick share across desktop and mobile browsers.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar variants.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx, titled 'My Brother's Keeper'.",
  "frontend/src/App.tsx": "Main React application component defining TanStack Router with all route definitions (landing, places, routes, profile, SOS, meetup, admin, emergency lookup, flyer), wrapping admin route with AuthenticatedRouteGuard and AdminRouteGuard, and including ThemeProvider, Toaster, AppLayout, and ProfileSetupDialog.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Access denied screen component with Request Admin Access button that calls useRequestAdminAccess mutation, displays loading state during request, shows success/error toasts, triggers onRetry callback to refetch user role on success, and provides a fallback button to navigate home.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard component that checks if the authenticated user has admin role, showing loading states, error screens, or access denied screens as appropriate. Includes retry functionality and extensive debug logging.",
  "frontend/src/components/auth/AuthenticatedRouteGuard.tsx": "Route guard component that requires user authentication via Internet Identity, displaying a login card if the user is not authenticated. Renders children only when identity is present.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component that toggles between login and logout states, handling Internet Identity authentication and clearing query cache on logout. Shows loading spinner during authentication.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, responsive sidebar navigation (desktop/mobile), main content area, and footer. Includes mobile menu sheet and conditional navigation display based on authentication.",
  "frontend/src/components/layout/AppNav.tsx": "Navigation component displaying main app routes (Places, Routes, Meetup, Profile, SOS) with icons, plus conditional admin dashboard link and emergency lookup. Highlights active route.",
  "frontend/src/components/layout/BrandHeader.tsx": "Application header with branding (\"My Brother's Keeper\"), navigation to home, share dialog trigger, conditional emergency lookup button, and login button. Sticky positioned with backdrop blur.",
  "frontend/src/components/maps/MapZoomControl.tsx": "Settings control for map zoom preference with dropdown selector for common zoom levels (10-20). Persists user preference and provides descriptions for zoom levels.",
  "frontend/src/components/profile/EmergencyAccessCodeCard.tsx": "Card component for generating, displaying, copying, and rotating emergency access codes. Shows user's Principal ID and includes warnings about sharing codes with trusted contacts only.",
  "frontend/src/components/profile/EmergencyProfileCard.tsx": "A form component for users to create/update their emergency profile with next of kin and health conditions, requiring an access code and displaying a privacy warning.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A modal dialog that appears for authenticated users without a profile, prompting them to enter their name to create their initial user profile.",
  "frontend/src/components/profile/VerificationUploadsCard.tsx": "A card component for uploading trucking license and ID proof documents with file validation, upload progress tracking, and verification status display.",
  "frontend/src/components/share/FlyerPreview.tsx": "A printable/exportable flyer component that displays app information, features, and a share URL for promoting the platform to truck drivers.",
  "frontend/src/components/share/ShareDialog.tsx": "A dialog for sharing the app via link copying, native share API, or viewing/downloading a promotional flyer, with error handling and user feedback.",
  "frontend/src/components/sos/LastKnownLocationCard.tsx": "Displays the last known GPS location from an SOS snapshot with timestamp, coordinates, Google Maps link, and a warning that it's not real-time tracking.",
  "frontend/src/components/sos/PublicSOSCardView.tsx": "Renders emergency profile information (next of kin, health conditions) and last known location for first responders accessing an SOS alert.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQrCodeCanvas.ts": "React hook that generates QR codes on canvas elements with status tracking, abort handling, and a 3-second safety timeout to prevent indefinite generation states.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profiles, routes, places, meetups, SOS features, and admin functions, all using the actor from useActor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using an asphalt and high-visibility safety color scheme with yellow-orange accents.",
  "frontend/src/lib/accessCode.ts": "Utility functions for generating, storing, retrieving, and clearing 12-character emergency access codes in localStorage.",
  "frontend/src/lib/clipboard.ts": "Resilient clipboard copy utility that attempts modern Clipboard API first, then falls back to deprecated execCommand for broader browser compatibility.",
  "frontend/src/lib/domToPng.ts": "Empty file with no content.",
  "frontend/src/lib/fileValidation.ts": "File validation utilities enforcing 10MB size limit and allowed types (JPEG, PNG, WebP, PDF) with helper functions for formatting file sizes.",
  "frontend/src/lib/flyerExport.ts": "Exports flyer components as PNG images by manually rendering content to canvas, including gradient backgrounds, text, icons, and QR codes at 2x scale for high resolution.",
  "frontend/src/lib/geolocation.ts": "Provides a Promise-based wrapper around the browser's Geolocation API to get current latitude/longitude coordinates with error handling for permission, availability, and timeout cases.",
  "frontend/src/lib/googleMapsUrl.ts": "Builds Google Maps URLs from latitude/longitude coordinates with optional zoom level parameter.",
  "frontend/src/lib/mapZoomPreference.ts": "Manages user's map zoom preference in localStorage with get/set/clear functions, default value of 15, and clamping between 1-21.",
  "frontend/src/lib/meetupShareCode.ts": "Generates 8-character alphanumeric meetup share codes (format: XXXX-XXXX) and manages their storage/retrieval in localStorage.",
  "frontend/src/lib/placeCategory.ts": "Defines human-readable labels for PlaceCategory enum values (Hotel, Restaurant, Shop, Gas Station, Mechanic) and provides helper functions to get labels and options.",
  "frontend/src/lib/principal.ts": "Validates and safely converts strings to DFINITY Principal objects, returning boolean validation results or null for invalid inputs.",
  "frontend/src/lib/qr.ts": "Empty file with no content.",
  "frontend/src/lib/qrCodeGenerator.ts": "Standards-compliant QR Code generator implementing ISO/IEC 18004 with Reed-Solomon error correction, Galois field arithmetic, and proper positioning patterns (file appears truncated).",
  "frontend/src/lib/qrDownload.ts": "Downloads a canvas element as a PNG file by converting to blob, validating dimensions, and triggering browser download with proper cleanup.",
  "frontend/src/lib/quickShare.ts": "Attempts to share URLs using Web Share API with automatic fallback to clipboard copying, returning detailed status results for appropriate user feedback.",
  "frontend/src/lib/shareUrl.ts": "Returns the canonical absolute share URL for the application using window.location.origin.",
  "frontend/src/lib/time.ts": "Converts between JavaScript Date objects and bigint nanosecond timestamps, and formats timestamps as human-readable date/time strings.",
  "frontend/src/lib/urlParams.ts": "Manages URL parameters for both standard query strings and hash-based routing, providing functions to get and clear parameters without page reload.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AddPlacePage.tsx": "Authenticated page with a form to add new places (name, category, location, description) to the trucker community database with validation and navigation (file appears truncated).",
  "frontend/src/pages/AddRoutePage.tsx": "Page for authenticated users to create and share a new route with start point, destination, optional waypoints, date/time, and notes. Includes form validation and navigation back to routes list.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin-only dashboard with three tabs: user registrations list, verification review lookup, and SOS locations map view. Allows admins to approve/reject verifications and view emergency data.",
  "frontend/src/pages/AdminReviewPage.tsx": "Empty file with no content.",
  "frontend/src/pages/EmergencyLookupPage.tsx": "Public page for first responders to look up a driver's emergency profile and SOS snapshot using their Principal ID and Emergency Access Code. Displays emergency contact info and last known location.",
  "frontend/src/pages/FlyerPage.tsx": "Page that displays a shareable flyer preview with QR code and allows users to download it as PNG or copy the share URL. Supports auto-export via URL parameter.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page showcasing the app's features (safe places, route sharing, emergency profiles, SOS, verified community) with hero section and feature cards. Redirects authenticated users to places page.",
  "frontend/src/pages/MeetupPage.tsx": "Provides real-time location sharing for meetups with periodic updates every 15 seconds, allowing users to start/stop sharing with a custom share code and lookup others' locations using their principal ID and share code.",
  "frontend/src/pages/PlaceDetailPage.tsx": "Displays detailed information for a specific safe place including name, location, category, description, and submitter principal ID with navigation back to the places list.",
  "frontend/src/pages/PlacesListPage.tsx": "Lists all safe places with search and category filtering capabilities, allowing authenticated users to add new places and navigate to place details.",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile with verification uploads, emergency profile, emergency access code, and principal ID with copy-to-clipboard functionality for authenticated users.",
  "frontend/src/pages/RouteDetailPage.tsx": "Placeholder page for displaying detailed route information with back navigation to routes list.",
  "frontend/src/pages/RoutesListPage.tsx": "Displays user's own routes and allows searching other users' routes by principal ID, with options to add new routes for authenticated users.",
  "frontend/src/pages/SOSCardPage.tsx": "Displays the user's emergency SOS card with emergency profile and snapshot information for first responders, requiring authentication and a stored access code.",
  "frontend/src/pages/SOSPage.tsx": "React page component for emergency SOS functionality that captures user's current location via geolocation API and displays an SOS card with emergency information.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, and animation keyframes for UI components.",
  "project_state.json": "Project state file tracking admin access management features, including implemented self-service admin privilege granting and a pending backend function requirement."
}