{
  "backend/main.mo": "Defines actor with mixins, user profiles, places, routes, emergency data, SOS snapshots, and access‑controlled CRUD operations.",
  "feature_evidence.json": "Contains feature evidence report describing a Quick Share addition and associated files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files covering routing, hooks, utilities, components, and pages.",
  "frontend/index.css": "Tailwind setup with custom CSS variables for light and dark themes and global base styles.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, app layout, theme provider, and initialization handling.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Renders an access denied message with navigation back to home.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Checks admin role and shows a loader or access denied screen before rendering protected admin content.",
  "frontend/src/components/auth/AuthenticatedRouteGuard.tsx": "Protects routes by requiring Internet Identity login and showing a login prompt when unauthenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity authentication state and query cache clearing.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper with header, sidebar or mobile menu, main content area, and footer, conditioned on user identity.",
  "frontend/src/components/layout/AppNav.tsx": "Navigation menu that highlights active routes and shows admin and emergency options based on user role.",
  "frontend/src/components/layout/BrandHeader.tsx": "Top header with app branding, share button, emergency lookup link, and login controls.",
  "frontend/src/components/profile/EmergencyAccessCodeCard.tsx": "Manages generating, viewing, copying, and rotating a user's emergency access code and principal ID.",
  "frontend/src/components/profile/EmergencyProfileCard.tsx": "Form for saving next-of-kin and medical information tied to the stored emergency access code.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter their name and create a profile.",
  "frontend/src/components/profile/VerificationUploadsCard.tsx": "Handles selecting, validating, uploading, and displaying status of license and ID verification documents.",
  "frontend/src/components/share/FlyerPreview.tsx": "Renders a styled flyer preview with QR code, share URL, and static promotional content. Uses refs to display a generated QR code and show loading state.",
  "frontend/src/components/share/ShareDialog.tsx": "Provides a modal for generating and sharing a QR code and link, including copy, download, quick share, and navigation to a flyer page. Manages QR generation and share actions with state and toasts.",
  "frontend/src/components/sos/PublicSOSCardView.tsx": "Displays emergency contact details and last known location for first responders, including health info and map links. Shows SOS snapshot data if available.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing queries when identity changes. Initializes access control using a secret parameter if available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity authentication. Handles identity loading, login, logout, and status tracking across the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend user, verification, and place APIs using the actor. Supports fetching profiles, roles, places, and performing mutations like creation and uploads.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light and dark theme CSS variables plus base element styles.",
  "frontend/src/lib/accessCode.ts": "Generates, stores, retrieves, and clears a formatted access code using localStorage with error handling.",
  "frontend/src/lib/fileValidation.ts": "Validates file size and type for uploads and provides a helper to format file sizes.",
  "frontend/src/lib/flyerExport.ts": "Converts a flyer DOM element to a high‑resolution PNG via SVG foreignObject and triggers a download.",
  "frontend/src/lib/geolocation.ts": "Wraps browser geolocation to return coordinates with detailed error handling.",
  "frontend/src/lib/placeCategory.ts": "Defines readable labels and options for PlaceCategory values and a helper to fetch labels.",
  "frontend/src/lib/qr.ts": "Generates a QR code by requesting an external API and drawing the result onto a canvas.",
  "frontend/src/lib/qrDownload.ts": "Converts a canvas to a PNG blob and downloads it as a file.",
  "frontend/src/lib/quickShare.ts": "Implements Web Share API with clipboard fallback and returns share status results.",
  "frontend/src/lib/shareUrl.ts": "Returns the app's base share URL from window.location.origin.",
  "frontend/src/lib/time.ts": "Converts between Date and bigint timestamps and formats them for display.",
  "frontend/src/lib/urlParams.ts": "Gets and removes URL parameters, supporting both query strings and hash‑based routing.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AddPlacePage.tsx": "Form page allowing authenticated users to add a new place with validation and API submission.",
  "frontend/src/pages/AddRoutePage.tsx": "Form page for creating a route with start, destination, optional waypoints, date/time, and notes, then submitting via a createRoute mutation.",
  "frontend/src/pages/AdminReviewPage.tsx": "Admin interface to look up a user by Principal ID and approve or reject their verification status.",
  "frontend/src/pages/EmergencyLookupPage.tsx": "Public emergency lookup page requiring a Principal ID and access code to fetch and display emergency profile data.",
  "frontend/src/pages/FlyerPage.tsx": "Generates a shareable flyer with a QR code, supports auto-export, manual download, and copying the share link.",
  "frontend/src/pages/LandingPage.tsx": "Landing page showing feature highlights and redirecting authenticated users to the places page.",
  "frontend/src/pages/PlaceDetailPage.tsx": "Displays detailed information about a selected place including location, category, description, and submitter.",
  "frontend/src/pages/PlacesListPage.tsx": "Displays a searchable and filterable list of places with category selection and optional add-place button for authenticated users.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the logged‑in user's profile with verification uploads and emergency settings, handling loading and authentication.",
  "frontend/src/pages/RouteDetailPage.tsx": "Placeholder page showing a simple route detail view with navigation back to the route list.",
  "frontend/src/pages/RoutesListPage.tsx": "Lists the user's routes and allows searching routes by principal ID, with tabs for personal and searched routes.",
  "frontend/src/pages/SOSCardPage.tsx": "Displays the user's emergency SOS card if available, loading emergency data using the stored access code.",
  "frontend/src/pages/SOSPage.tsx": "Allows capturing a one‑time SOS location snapshot and provides navigation to view the SOS card.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence and hash support.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom color tokens, extended theme settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking app summary, architectural notes, issues, and a list of implemented features with requirement IDs and versions."
}