{
  "backend/main.mo": "Defines the backend canister with mixins, user profiles, places, routes, emergency profiles, SOS snapshots, and related CRUD and permission‑checked operations.",
  "feature_evidence.json": "Lists feature evidence entries linking features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend source files for reference or build planning.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and global styling rules.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React router setup defining all application routes and layout with theme and identity initialization.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when a user attempts to access a restricted admin page.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard that checks user role and blocks non-admin users with an access denied screen.",
  "frontend/src/components/auth/AuthenticatedRouteGuard.tsx": "Route guard prompting unauthenticated users to log in before accessing protected pages.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity auth flow and query cache clearing.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapping header, navigation, mobile menu, content, and footer, with conditional navigation based on identity.",
  "frontend/src/components/layout/AppNav.tsx": "Sidebar and mobile navigation menu with role-based admin link and route highlighting.",
  "frontend/src/components/layout/BrandHeader.tsx": "Top header with branding, share button, emergency lookup button, and login controls.",
  "frontend/src/components/profile/EmergencyAccessCodeCard.tsx": "Generates, displays, copies, and rotates a user's emergency access code and shows their Principal ID.",
  "frontend/src/components/profile/EmergencyProfileCard.tsx": "Form for saving next-of-kin and medical information tied to the stored emergency access code.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter their name and create a profile.",
  "frontend/src/components/profile/VerificationUploadsCard.tsx": "Handles uploading license and ID documents with validation, progress tracking, and displays verification status.",
  "frontend/src/components/share/FlyerPreview.tsx": "Renders a flyer preview with header, intro, QR code canvas, and share URL, showing loading and error states.",
  "frontend/src/components/share/ShareDialog.tsx": "Dialog for generating, sharing, copying, and downloading a QR code and link, using quick share and navigation helpers.",
  "frontend/src/components/sos/PublicSOSCardView.tsx": "Displays emergency contacts and last known SOS location for first responders, including map links and timestamps.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and identity persistence via an AuthClient provider.",
  "frontend/src/hooks/useQrCodeCanvas.ts": "Hook that renders a QR code to a canvas and tracks readiness or errors.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, verification, places, and other backend interactions using the actor.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light and dark theme CSS variables with global base styles.",
  "frontend/src/lib/accessCode.ts": "Generates, stores, retrieves, and clears a 12‑char access code in localStorage.",
  "frontend/src/lib/clipboard.ts": "Provides resilient clipboard copy functionality with a secure‑context API and fallback method.",
  "frontend/src/lib/fileValidation.ts": "Validates file size/type and includes a helper to format file sizes.",
  "frontend/src/lib/flyerExport.ts": "Exports a flyer DOM element as a high‑resolution PNG using an SVG foreignObject render approach.",
  "frontend/src/lib/geolocation.ts": "Wraps browser geolocation API to return coordinates with detailed error handling.",
  "frontend/src/lib/placeCategory.ts": "Maps place category enums to labels and provides options and lookup helper.",
  "frontend/src/lib/qr.ts": "Empty placeholder file.",
  "frontend/src/lib/qrCodeGenerator.ts": "Implements a low‑level QR code generator with error correction and module layout logic.",
  "frontend/src/lib/qrDownload.ts": "Downloads a canvas as a PNG after validating dimensions and blob creation.",
  "frontend/src/lib/quickShare.ts": "Implements Web Share API helper with clipboard fallback and detailed result statuses.",
  "frontend/src/lib/shareUrl.ts": "Returns the canonical base share URL from window.location.origin.",
  "frontend/src/lib/time.ts": "Provides bigint‑based time conversion and date formatting utilities.",
  "frontend/src/lib/urlParams.ts": "Manages URL parameters for both query and hash routing with read/remove utilities.",
  "frontend/src/main.tsx": "Bootstraps React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AddPlacePage.tsx": "Form page for authenticated users to add a new place with name, category, location, and description using a mutation.",
  "frontend/src/pages/AddRoutePage.tsx": "Form page for creating a new route with start, destination, optional waypoints, date/time, and notes, then submitting via mutation.",
  "frontend/src/pages/AdminReviewPage.tsx": "Admin-only interface to look up a user by principal ID and approve or reject their verification status.",
  "frontend/src/pages/EmergencyLookupPage.tsx": "Public page allowing emergency responders to look up a user's emergency data using principal ID and access code.",
  "frontend/src/pages/FlyerPage.tsx": "Page that generates a shareable flyer with QR code, supports auto-export, manual download, and link copying.",
  "frontend/src/pages/LandingPage.tsx": "Landing page showing hero section and feature cards; redirects authenticated users to the places list.",
  "frontend/src/pages/PlaceDetailPage.tsx": "Displays details for a selected place including description, category, and submitter info.",
  "frontend/src/pages/PlacesListPage.tsx": "Lists searchable and filterable safe places with an option to add new ones.",
  "frontend/src/pages/ProfilePage.tsx": "User profile view showing account info plus verification and emergency profile management.",
  "frontend/src/pages/RouteDetailPage.tsx": "Placeholder page for viewing details of a specific route.",
  "frontend/src/pages/RoutesListPage.tsx": "Displays user routes and lets users search routes by principal, with an option to add new routes.",
  "frontend/src/pages/SOSCardPage.tsx": "Shows the user's emergency SOS card if available or prompts setup when missing.",
  "frontend/src/pages/SOSPage.tsx": "Defines the SOS page UI, allowing authenticated users to capture their current location via a snapshot mutation and navigate to the SOS card.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based query cleanup.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, feature versions, known issues, and architectural notes for the build state."
}