{
  "backend/main.mo": "Motoko canister implementing user profiles, places, routes, emergency data, and SOS snapshots with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report linking features to affected frontend files, components, and related test IDs.",
  "frontend-file-summaries.txt": "Prewritten summary list describing the purpose of various frontend source files.",
  "frontend/index.css": "Tailwind CSS config defining theme variables and base styles for light and dark modes.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Application router setup registering all routes, layout, theme, and profile setup dialog.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen displaying an access denied message with a button to return home.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard that checks admin role and shows a loading state or access denied screen.",
  "frontend/src/components/auth/AuthenticatedRouteGuard.tsx": "Route guard requiring Internet Identity login before showing protected content.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling authentication flow and query cache clearing.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, sidebar or mobile menu, content area, and footer, showing navigation only when the user is authenticated.",
  "frontend/src/components/layout/AppNav.tsx": "Renders the navigation menu with route buttons and admin options based on user role, handling navigation events.",
  "frontend/src/components/layout/BrandHeader.tsx": "Displays the top header with branding, share button, emergency lookup, and login controls, plus a share dialog.",
  "frontend/src/components/profile/EmergencyAccessCodeCard.tsx": "Manages generating, storing, displaying, copying, and rotating an emergency access code tied to the user's principal ID.",
  "frontend/src/components/profile/EmergencyProfileCard.tsx": "Provides a form for saving next-of-kin and medical information, requiring an existing emergency access code.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Shows a setup dialog prompting new authenticated users to create a basic profile by entering their name.",
  "frontend/src/components/profile/VerificationUploadsCard.tsx": "Handles validation and uploading of license and ID documents with progress tracking and shows verification status.",
  "frontend/src/components/share/FlyerPreview.tsx": "Renders a flyer preview with app branding, intro text, QR code canvas, and share URL, supporting loading state via isGenerating.",
  "frontend/src/components/share/ShareDialog.tsx": "Displays a dialog for generating, copying, sharing, and downloading a QR code and link, with navigation to view or export a flyer.",
  "frontend/src/components/sos/PublicSOSCardView.tsx": "Shows emergency contact info and last known SOS location, including timestamps and map links for first responders.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches an authenticated or anonymous backend actor, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity authentication, including loading, login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, verification, places, and routes using the backend actor.",
  "frontend/src/index.css": "Tailwind base setup defining light and dark theme CSS variables and applying global styles.",
  "frontend/src/lib/accessCode.ts": "Generates, stores, retrieves, and clears a 12‑character access code using localStorage.",
  "frontend/src/lib/fileValidation.ts": "Validates file size/type and provides a helper to format file sizes.",
  "frontend/src/lib/flyerExport.ts": "Exports a flyer DOM element as a PNG using a temporary canvas and SVG foreignObject.",
  "frontend/src/lib/geolocation.ts": "Retrieves the user's geolocation with detailed error handling.",
  "frontend/src/lib/placeCategory.ts": "Maps place categories to labels and provides helper utilities for category display.",
  "frontend/src/lib/qr.ts": "Implements a lightweight client‑side QR code generator with custom matrix creation.",
  "frontend/src/lib/qrDownload.ts": "Converts a canvas to a PNG blob and triggers a download.",
  "frontend/src/lib/quickShare.ts": "Shares a URL via Web Share API with clipboard fallback and status reporting.",
  "frontend/src/lib/shareUrl.ts": "Returns the app's canonical share URL based on window.location.origin.",
  "frontend/src/lib/time.ts": "Converts between dates and bigint timestamps and formats them.",
  "frontend/src/lib/urlParams.ts": "Gets and clears URL parameters for both query and hash routing without reload.",
  "frontend/src/main.tsx": "App entry point initializing React, Internet Identity provider, query client, and global styles.",
  "frontend/src/pages/AddPlacePage.tsx": "Form page for authenticated users to add a new place with validation and submission handling.",
  "frontend/src/pages/AddRoutePage.tsx": "Form page for creating and submitting a new route with start, destination, optional waypoints, date/time, and notes.",
  "frontend/src/pages/AdminReviewPage.tsx": "Admin interface to look up users by Principal ID and approve or reject their verification.",
  "frontend/src/pages/EmergencyLookupPage.tsx": "Allows first responders to fetch emergency info using a driver's Principal ID and access code.",
  "frontend/src/pages/FlyerPage.tsx": "Generates a shareable flyer with a QR code, supporting auto-export, manual download, and link copying.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page introducing platform features and redirecting authenticated users to the places list.",
  "frontend/src/pages/PlaceDetailPage.tsx": "Displays details for a selected place including description, category, location, and submitter info.",
  "frontend/src/pages/PlacesListPage.tsx": "Displays a searchable and filterable list of places with category selection and optional add-place button for authenticated users.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the user's profile with verification, emergency access code, and emergency profile sections, loading data from user queries.",
  "frontend/src/pages/RouteDetailPage.tsx": "Placeholder page showing route details with a back navigation button.",
  "frontend/src/pages/RoutesListPage.tsx": "Lists the user's routes and allows searching routes by principal, with navigation to add new routes.",
  "frontend/src/pages/SOSCardPage.tsx": "Displays the user's emergency SOS card if available, loading emergency profile data and offering navigation to setup if missing.",
  "frontend/src/pages/SOSPage.tsx": "Allows users to capture their current location for SOS purposes and navigate to view their SOS card.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, persist, and clear URL parameters and session-stored values, supporting hash and query string formats.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and layout settings, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "JSON snapshot describing the app’s current build state, requirements, features, known issues, and architectural notes."
}