{
  "backend/main.mo": "Main backend actor implementing user profiles, places, routes, emergency profiles, SOS snapshots, meetup locations, and activity logs with role-based access control using hardcoded admin principal and AccessControl mixin.",
  "feature_evidence.json": "Feature evidence report documenting that the hardcoded admin principal '2yscf-yuwfq-41ml4-t6ujy-r3ogj-ajbkj-rmiih-uyk25-o34ky-6jpe6-gae' is checked by AdminRouteGuard and useIsCallerAdmin hook for admin dashboard access.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, hooks, pages, and utilities with focus on admin authorization flow, authentication guards, and enhanced debugging for admin status checks.",
  "frontend/docs/flyer-download-smoke-test.md": "Manual smoke test checklist for flyer download functionality covering direct download, share dialog auto-export, link sharing, error handling, and quick share across desktop and mobile browsers.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including sidebar, charts, and semantic color tokens using oklch color space.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and root div mounting point.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all route definitions, QueryClient setup, ThemeProvider, and route guards for authenticated and admin-only pages.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Access denied screen component displayed when users lack admin permissions, showing a shield alert icon and button to return home.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard component that checks admin status using useIsCallerAdmin hook with comprehensive console logging and loading states, rendering AccessDeniedScreen if user is not admin or if errors occur.",
  "frontend/src/components/auth/AuthenticatedRouteGuard.tsx": "A route guard component that displays a login prompt card if the user is not authenticated, otherwise renders its children.",
  "frontend/src/components/auth/LoginButton.tsx": "A button component that toggles between login and logout states, handling Internet Identity authentication and clearing the query cache on logout.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with a sticky header, responsive sidebar navigation (desktop/mobile), main content area, and footer with attribution link.",
  "frontend/src/components/layout/AppNav.tsx": "Navigation menu component displaying links to Places, Routes, Meetup, Profile, and conditionally shows Admin Dashboard link for admin users.",
  "frontend/src/components/layout/BrandHeader.tsx": "Sticky header component with app branding, navigation to home, share button, emergency lookup link (for unauthenticated users), and login button.",
  "frontend/src/components/maps/MapZoomControl.tsx": "A settings control component that allows users to select and persist their preferred map zoom level for Google Maps links.",
  "frontend/src/components/profile/EmergencyAccessCodeCard.tsx": "Card component for generating, displaying, copying, and rotating emergency access codes, along with showing the user's Principal ID for emergency lookup.",
  "frontend/src/components/profile/EmergencyProfileCard.tsx": "Form card for creating/updating emergency profile information including next of kin and health conditions, requiring an access code to be generated first.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Modal dialog that appears for authenticated users without a profile, prompting them to enter their name to create an initial user profile.",
  "frontend/src/components/profile/VerificationUploadsCard.tsx": "React component that allows users to upload verification documents (trucking license and ID proof) with file validation, progress tracking, and displays verification status badges (Not Submitted, Pending Review, or Approved).",
  "frontend/src/components/share/FlyerPreview.tsx": "A forwardRef component that renders a printable/shareable flyer for the \"My Brother's Keeper\" trucker safety platform, displaying app features, benefits, and a shareable URL in a formatted layout.",
  "frontend/src/components/share/ShareDialog.tsx": "Dialog component for sharing the app via multiple methods (copy link, quick share API, view/download flyer), with error handling and toast notifications for each sharing action.",
  "frontend/src/components/sos/LastKnownLocationCard.tsx": "Card component that displays the last known GPS location from an SOS snapshot with timestamp, coordinates, and a Google Maps link, including a warning that it's a one-time snapshot not real-time tracking.",
  "frontend/src/components/sos/PublicSOSCardView.tsx": "Public-facing emergency information display showing driver details, emergency contacts, health conditions, and last known location for first responders accessing an SOS alert.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, handling both authenticated and anonymous actors, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options for idle handling and derivation origins.",
  "frontend/src/hooks/useQrCodeCanvas.ts": "React hook that generates a QR code on a canvas element with status tracking (idle/generating/ready/error), abort control for re-generation, and a 3-second safety timeout.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching user profiles, roles, admin status, places, routes, meetup locations, SOS snapshots, activity logs, and mutations for creating/updating entities with cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using an asphalt and high-visibility safety color scheme (yellow-orange accents, safety red destructive colors).",
  "frontend/src/lib/accessCode.ts": "Utility functions to generate, store, retrieve, and clear 12-character emergency access codes in localStorage with format XXXX-XXXX-XXXX.",
  "frontend/src/lib/adminPromotion.ts": "Empty file with no content.",
  "frontend/src/lib/clipboard.ts": "Resilient clipboard copy utility that attempts modern Clipboard API first, then falls back to deprecated execCommand with DOM selection for broader browser compatibility.",
  "frontend/src/lib/domToPng.ts": "Empty file with no content.",
  "frontend/src/lib/eventType.ts": "Provides human-readable labels for EventType enum values and exports an array of event type options for UI selection components.",
  "frontend/src/lib/fileValidation.ts": "Validates uploaded files against 10MB size limit and allowed types (JPEG, PNG, WebP, PDF), and provides file size formatting utility.",
  "frontend/src/lib/flyerExport.ts": "Exports a flyer component as a PNG image by manually rendering text, gradients, icons, and QR code to a canvas at 2x scale for high-resolution output.",
  "frontend/src/lib/geolocation.ts": "Wraps browser Geolocation API in a Promise to get current location with high accuracy, 10-second timeout, and user-friendly error messages.",
  "frontend/src/lib/googleMapsUrl.ts": "Builds Google Maps URLs from latitude/longitude coordinates with optional zoom level parameter.",
  "frontend/src/lib/mapZoomPreference.ts": "Manages map zoom level preferences in localStorage with default value of 15, clamping between 1-21, and error-safe get/set/clear operations.",
  "frontend/src/lib/meetupShareCode.ts": "Generates, stores, retrieves, and clears 8-character meetup share codes (format XXXX-XXXX) in localStorage for location sharing.",
  "frontend/src/lib/placeCategory.ts": "Defines PlaceCategory labels, options, and a helper function to get category labels for display purposes.",
  "frontend/src/lib/principal.ts": "Provides validation and safe conversion utilities for DFINITY Principal IDs from text strings.",
  "frontend/src/lib/qr.ts": "Empty file with no content.",
  "frontend/src/lib/qrCodeGenerator.ts": "Implements a standards-compliant QR Code generator with Reed-Solomon error correction, Galois field operations, and pattern placement according to ISO/IEC 18004.",
  "frontend/src/lib/qrDownload.ts": "Provides a function to download a canvas element as a PNG image file with validation and error handling.",
  "frontend/src/lib/quickShare.ts": "Implements URL sharing using the Web Share API with automatic clipboard fallback, returning detailed status results for user feedback.",
  "frontend/src/lib/shareUrl.ts": "Returns the canonical absolute share URL for the application using window.location.origin.",
  "frontend/src/lib/time.ts": "Provides conversion utilities between JavaScript Date objects and bigint timestamps, plus formatting functions for dates and datetimes.",
  "frontend/src/lib/urlParams.ts": "Utilities for managing URL parameters in both query string and hash-based routing, including getting and clearing parameters.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AddPlacePage.tsx": "Form page for authenticated users to add a new safe place with name, category, location, and description fields.",
  "frontend/src/pages/AddRoutePage.tsx": "Form page for authenticated users to create a new route with start, destination, waypoints, datetime, and optional notes.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard with tabs for managing user registrations, verification reviews, SOS locations, member directory, and activity logs. Includes filtering, search, pagination, and actions to approve/reject verifications.",
  "frontend/src/pages/AdminReviewPage.tsx": "Empty file with no content.",
  "frontend/src/pages/EmergencyLookupPage.tsx": "Public emergency lookup page where first responders can access driver emergency profiles and SOS snapshots using a Principal ID and Emergency Access Code.",
  "frontend/src/pages/FlyerPage.tsx": "Displays a shareable flyer with QR code and app link, supports manual and auto-triggered PNG export, and allows copying the share URL to clipboard.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page showcasing app features (safe places, route sharing, emergency profiles, SOS, verified community) with hero section and feature cards. Redirects authenticated users to /places.",
  "frontend/src/pages/MeetupPage.tsx": "Allows authenticated users to share their live location with a custom share code (updated every 15 seconds) and lookup other users' meetup locations using their Principal ID and share code.",
  "frontend/src/pages/PlaceDetailPage.tsx": "Displays detailed information for a single safe place including name, location, category, description, and submitter information with navigation back to places list.",
  "frontend/src/pages/PlacesListPage.tsx": "Displays a searchable and filterable list of safe places with category selection, allowing authenticated users to add new places and navigate to place details.",
  "frontend/src/pages/ProfilePage.tsx": "Shows user profile information including verification status, principal ID, admin badge, and cards for verification uploads, emergency profile, and emergency access code management.",
  "frontend/src/pages/RouteDetailPage.tsx": "Placeholder page for viewing route details with a back button to return to the routes list.",
  "frontend/src/pages/RoutesListPage.tsx": "Displays user's routes and allows searching other users' routes by principal ID, with tabs for 'My Routes' and 'Search Routes' and ability to add new routes.",
  "frontend/src/pages/SOSCardPage.tsx": "Displays the user's emergency SOS card with emergency profile and snapshot information for first responders, requiring authentication and access code.",
  "frontend/src/pages/SOSPage.tsx": "Allows authenticated users to capture their current location as an SOS snapshot and navigate to view their emergency SOS card.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, extends theme with custom animations (accordion), border radius variables, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking file for a membership management system with admin dashboard, documenting a fix request for admin access issues and pending feature requests to add a hardcoded admin Principal ID '2yscf-yuwfq-41ml4-t6ujy-r3ogj-ajbkj-rmiih-uyk25-o34ky-6jpe6-gae' for monitoring memberships."
}