{
  "backend/main.mo": "Main backend actor implementing user profiles, places, routes, emergency profiles, SOS snapshots, meetup locations, and admin access control with authorization mixins and blob storage for verification documents.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: displaying a 'Request Admin Access' button on the Profile page and refreshing user roles after successful admin access requests.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components for authentication, profile management, SOS functionality, admin guards, and the new useRequestAdminAccess mutation hook.",
  "frontend/docs/flyer-download-smoke-test.md": "Manual smoke test checklist for flyer download functionality covering direct downloads, share dialog auto-export, link sharing, error handling, and quick share across desktop and mobile browsers.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including sidebar, chart, and component-specific color tokens.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and root div mounting point.",
  "frontend/src/App.tsx": "Main application component defining TanStack Router configuration with all route definitions, including admin routes wrapped with AuthenticatedRouteGuard and AdminRouteGuard, plus theme provider and profile setup dialog.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Access denied screen component displaying when users lack admin permissions, featuring a 'Request Admin Access' button that calls useRequestAdminAccess mutation and triggers role refetch on success.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard component that checks if the authenticated user has admin role, showing loading state during verification and an access denied screen if the user is not an admin.",
  "frontend/src/components/auth/AuthenticatedRouteGuard.tsx": "Route guard component that requires Internet Identity authentication, displaying a login card if the user is not authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component that toggles between login and logout states using Internet Identity, clearing query cache on logout.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with brand header, responsive sidebar navigation (desktop/mobile), main content area, and footer with Caffeine.ai attribution.",
  "frontend/src/components/layout/AppNav.tsx": "Navigation component displaying menu items for Places, Routes, Meetup, Profile, SOS, Emergency Lookup, and conditionally showing Admin Dashboard for admin users.",
  "frontend/src/components/layout/BrandHeader.tsx": "Sticky header component with \"My Brother's Keeper\" branding, share button, emergency lookup link for unauthenticated users, and login button.",
  "frontend/src/components/maps/MapZoomControl.tsx": "Settings control for selecting and persisting preferred map zoom level (10-20) for Google Maps links.",
  "frontend/src/components/profile/EmergencyAccessCodeCard.tsx": "Card component for generating, displaying, copying, and rotating emergency access codes that trusted contacts can use with the user's Principal ID for emergency profile lookup.",
  "frontend/src/components/profile/EmergencyProfileCard.tsx": "A form component for users to create/update their emergency profile with next-of-kin contact and health conditions, requiring an access code and displaying warnings about privacy.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A modal dialog that prompts authenticated users without a profile to enter their name and create their initial user profile, blocking dismissal until completed.",
  "frontend/src/components/profile/VerificationUploadsCard.tsx": "A card component for uploading trucking license and ID proof documents with file validation, upload progress tracking, and verification status badges (Not Submitted, Pending Review, Approved).",
  "frontend/src/components/share/FlyerPreview.tsx": "A printable/exportable flyer component displaying app branding, feature list, and share URL in a formatted layout for physical distribution.",
  "frontend/src/components/share/ShareDialog.tsx": "A dialog for sharing the app via link copying, native share API, or navigating to flyer view/download, with error handling and user feedback.",
  "frontend/src/components/sos/LastKnownLocationCard.tsx": "Displays the last known GPS location from an SOS snapshot with timestamp, coordinates, Google Maps link, and a warning that it's a one-time snapshot not real-time tracking.",
  "frontend/src/components/sos/PublicSOSCardView.tsx": "Renders emergency profile information (driver name, next-of-kin, health conditions) and last known location for first responders accessing an SOS alert.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQrCodeCanvas.ts": "React hook that generates QR codes on canvas elements with status tracking, abort handling, and a 3-second safety timeout to prevent indefinite generation states.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, admin operations, places, routes, meetups, and SOS functionality, wrapping backend actor calls with caching and mutation handling.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using an asphalt and high-visibility safety color scheme with yellow-orange accents.",
  "frontend/src/lib/accessCode.ts": "Utility functions for generating, storing, retrieving, and clearing 12-character emergency access codes in localStorage.",
  "frontend/src/lib/clipboard.ts": "Resilient clipboard copy utility that attempts modern Clipboard API first, then falls back to deprecated execCommand for broader browser compatibility.",
  "frontend/src/lib/domToPng.ts": "Empty file with no content.",
  "frontend/src/lib/fileValidation.ts": "File validation utilities enforcing 10MB size limit and allowed types (JPEG, PNG, WebP, PDF) with file size formatting helper.",
  "frontend/src/lib/flyerExport.ts": "Exports flyer components as PNG images by manually rendering content to canvas, including gradient backgrounds, text, icons, and QR codes for mobile-friendly sharing.",
  "frontend/src/lib/geolocation.ts": "Provides a Promise-based wrapper around the browser's Geolocation API to get current latitude/longitude coordinates with error handling for permission, availability, and timeout scenarios.",
  "frontend/src/lib/googleMapsUrl.ts": "Builds Google Maps URLs from latitude/longitude coordinates with optional zoom level parameter.",
  "frontend/src/lib/mapZoomPreference.ts": "Manages user's map zoom preference in localStorage with get/set/clear operations, clamping values between 1-21 with a default of 15.",
  "frontend/src/lib/meetupShareCode.ts": "Generates 8-character alphanumeric meetup share codes (format: XXXX-XXXX) and manages their storage/retrieval in localStorage.",
  "frontend/src/lib/placeCategory.ts": "Defines labels and utility functions for PlaceCategory enum values (hotel, restaurant, shop, gas station, mechanic).",
  "frontend/src/lib/principal.ts": "Provides validation and safe conversion utilities for DFINITY Principal IDs from text strings.",
  "frontend/src/lib/qr.ts": "Empty file with no content.",
  "frontend/src/lib/qrCodeGenerator.ts": "Standards-compliant QR Code generator implementing ISO/IEC 18004 with Reed-Solomon error correction, Galois field arithmetic, and proper positioning patterns (truncated content).",
  "frontend/src/lib/qrDownload.ts": "Downloads a canvas element as a PNG file by converting to blob and triggering a download link, with validation for canvas readiness.",
  "frontend/src/lib/quickShare.ts": "Attempts to share URLs using the Web Share API with automatic fallback to clipboard copying, returning detailed status results for appropriate user feedback.",
  "frontend/src/lib/shareUrl.ts": "Returns the canonical absolute share URL for the application using window.location.origin.",
  "frontend/src/lib/time.ts": "Converts between JavaScript Date objects and bigint nanosecond timestamps, with formatting functions for date/time display.",
  "frontend/src/lib/urlParams.ts": "Utilities for managing URL parameters in both query string and hash-based routing contexts, supporting get and clear operations.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AddPlacePage.tsx": "Authenticated form page for adding new places with fields for name, category, location, and description, using React Hook Form and navigation (truncated content).",
  "frontend/src/pages/AddRoutePage.tsx": "Page for authenticated users to create and share a new route with start, destination, waypoints, date/time, and optional notes. Includes form validation and navigation back to routes list.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin-only dashboard with three tabs: user registrations list, verification review lookup, and SOS locations map view. Allows admins to approve/reject verifications and view emergency data.",
  "frontend/src/pages/AdminReviewPage.tsx": "Empty file with no content.",
  "frontend/src/pages/EmergencyLookupPage.tsx": "Public page allowing first responders to look up driver emergency information using Principal ID and access code. Displays emergency profile and SOS snapshot if credentials are valid.",
  "frontend/src/pages/FlyerPage.tsx": "Page for generating and downloading a shareable flyer with QR code. Supports auto-export via URL parameter and manual download, with clipboard copy functionality for share URL.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page showcasing app features (safe places, route sharing, emergency profiles, SOS) with hero section and feature cards. Redirects authenticated users to places page.",
  "frontend/src/pages/MeetupPage.tsx": "Provides real-time location sharing for meetups with periodic updates every 15 seconds, allowing users to start/stop sharing with a custom share code and look up others' locations using their principal ID and share code.",
  "frontend/src/pages/PlaceDetailPage.tsx": "Displays detailed information for a specific safe place including name, location, category, description, and submitter, with navigation back to the places list.",
  "frontend/src/pages/PlacesListPage.tsx": "Lists all safe places with search and category filtering capabilities, allowing authenticated users to add new places and view details of existing ones.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page displaying principal ID, verification uploads, emergency profile, emergency access code, and admin access request functionality for authenticated users.",
  "frontend/src/pages/RouteDetailPage.tsx": "Placeholder page for displaying detailed route information with back navigation to the routes list.",
  "frontend/src/pages/RoutesListPage.tsx": "Displays user's own routes and allows searching for other users' routes by principal ID, with options to add new routes and view route details in a tabbed interface.",
  "frontend/src/pages/SOSCardPage.tsx": "Displays the user's emergency SOS card containing emergency profile information and SOS snapshot data for first responders, requiring authentication and a stored access code.",
  "frontend/src/pages/SOSPage.tsx": "React component for the Emergency SOS page that allows users to capture their current location as a one-time snapshot and view their SOS card, using geolocation API and mutation hooks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended theme properties, animations, and plugin integrations for typography and container queries.",
  "project_state.json": "Project metadata tracking architectural notes, known issues (missing 'Request Admin Access' button), and existing features related to admin access request functionality."
}