{
  "backend/main.mo": "Motoko canister defining user profiles, places, routes, emergency data, SOS snapshots, meetup locations, and access-controlled CRUD/query functions.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-style mapping of frontend file paths to their respective short functional descriptions.",
  "frontend/docs/flyer-download-smoke-test.md": "Manual smoke‑test checklist for verifying flyer download, sharing, and error handling flows.",
  "frontend/index.css": "Tailwind CSS setup defining base layers, color variables, theming, and global styles for light and dark modes.",
  "frontend/index.html": "Base HTML document mounting the root React app and loading the main entry script.",
  "frontend/src/App.tsx": "Main React router configuration defining all routes, layouts, and initialization logic.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when users attempt to access pages without required permissions.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Component that checks admin role and displays loading or access‑denied UI before rendering children.",
  "frontend/src/components/auth/AuthenticatedRouteGuard.tsx": "Shows a login card if no Internet Identity is present; otherwise renders its children.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading states and automatic retries.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, optional authenticated sidebar, mobile menu, content area, and footer.",
  "frontend/src/components/layout/AppNav.tsx": "Renders navigation buttons based on current route and user role, including admin and emergency lookup links.",
  "frontend/src/components/layout/BrandHeader.tsx": "Displays the top header with branding, share button, optional emergency lookup link, and login button.",
  "frontend/src/components/profile/EmergencyAccessCodeCard.tsx": "Manages generating, viewing, rotating, and copying an emergency access code tied to the user's principal.",
  "frontend/src/components/profile/EmergencyProfileCard.tsx": "Lets users submit next-of-kin and medical info, requiring an existing emergency access code.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Prompts new authenticated users without a profile to enter their name and create one.",
  "frontend/src/components/profile/VerificationUploadsCard.tsx": "Provides UI for uploading license and ID files, validates them, tracks upload progress, and displays verification status.",
  "frontend/src/components/share/FlyerPreview.tsx": "Renders a stylized flyer preview with branding, app description, and share URL.",
  "frontend/src/components/share/ShareDialog.tsx": "Dialog for generating, copying, and sharing the app’s public share URL, with options to view or download a flyer.",
  "frontend/src/components/sos/LastKnownLocationCard.tsx": "Displays the user’s last recorded SOS location with timestamp, coordinates, and a Google Maps link.",
  "frontend/src/components/sos/PublicSOSCardView.tsx": "Shows emergency contact info and optional health details along with last known SOS location for first responders.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity management via React context using Dfinity AuthClient.",
  "frontend/src/hooks/useQrCodeCanvas.ts": "React hook that generates a QR code on a canvas with abort, timeout, and status management.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, roles, verification, and admin data via an actor API.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark themes and custom component classes.",
  "frontend/src/lib/accessCode.ts": "Generates, stores, retrieves, and clears a 12‑character access code in localStorage.",
  "frontend/src/lib/clipboard.ts": "Clipboard copy utility with secure-context checks and DOM fallback for older browsers.",
  "frontend/src/lib/domToPng.ts": "Empty placeholder file for DOM-to-PNG logic.",
  "frontend/src/lib/fileValidation.ts": "Validates file type and size and provides a helper to format file sizes.",
  "frontend/src/lib/flyerExport.ts": "Manually renders a flyer element to a canvas and exports it as a PNG image.",
  "frontend/src/lib/geolocation.ts": "Fetches the user's current GPS coordinates with error handling for geolocation failures.",
  "frontend/src/lib/meetupShareCode.ts": "Generates, stores, retrieves, and clears an 8‑character meetup share code in localStorage.",
  "frontend/src/lib/placeCategory.ts": "Maps place categories to labels and provides option lists and label lookup.",
  "frontend/src/lib/principal.ts": "Validates and safely converts text to a Dfinity Principal.",
  "frontend/src/lib/qr.ts": "Empty placeholder file for QR-related logic.",
  "frontend/src/lib/qrCodeGenerator.ts": "Implements a standards-based QR code generator with Galois field math and Reed-Solomon error correction.",
  "frontend/src/lib/qrDownload.ts": "Exports a function to download a canvas element as a PNG file with validation and error handling.",
  "frontend/src/lib/quickShare.ts": "Provides a Web Share API helper with clipboard fallback and detailed status results.",
  "frontend/src/lib/shareUrl.ts": "Returns the app’s canonical share URL using window.location.origin.",
  "frontend/src/lib/time.ts": "Converts dates to bigint timestamps and formats them for display.",
  "frontend/src/lib/urlParams.ts": "Utilities for getting and clearing URL parameters in both query and hash routing modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/AddPlacePage.tsx": "Form page for authenticated users to create and submit a new place entry.",
  "frontend/src/pages/AddRoutePage.tsx": "Form page for creating a new route with waypoints and scheduled time.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard for managing user profiles, verification reviews, and SOS location data.",
  "frontend/src/pages/AdminReviewPage.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/pages/EmergencyLookupPage.tsx": "Provides a form for entering a driver's principal ID and access code, then fetches and displays emergency profile or SOS data. Handles validation, loading, and error states for first-responder access.",
  "frontend/src/pages/FlyerPage.tsx": "Generates, previews, copies, and downloads a shareable flyer image using a share URL, supporting auto‑export via URL params. Manages export state and user notifications.",
  "frontend/src/pages/LandingPage.tsx": "Displays the public landing page with feature highlights and redirects authenticated users to the places list. Includes navigation to the emergency lookup page.",
  "frontend/src/pages/MeetupPage.tsx": "Allows users to share and periodically update their meetup location with a share code, and lets others look up a driver's latest shared location. Handles validation, geolocation, mutations, and error states.",
  "frontend/src/pages/PlaceDetailPage.tsx": "Shows full details for a selected place, including category, description, location, and submitter. Redirects to the places list if the place is not found.",
  "frontend/src/pages/PlacesListPage.tsx": "Lists safe places with category filtering and text search, and allows authenticated users to add new places. Displays loading and empty states accordingly.",
  "frontend/src/pages/ProfilePage.tsx": "Renders the authenticated user profile page, loading the user profile and displaying profile info along with verification and emergency setup cards.",
  "frontend/src/pages/RouteDetailPage.tsx": "Provides a placeholder route detail view with a back button to the routes list.",
  "frontend/src/pages/RoutesListPage.tsx": "Displays the user's routes and allows searching routes by principal, with tabs for 'My Routes' and 'Search Routes' and navigation to add new routes.",
  "frontend/src/pages/SOSCardPage.tsx": "Shows the user's SOS emergency card, loading emergency data and falling back to profile setup guidance if none exists.",
  "frontend/src/pages/SOSPage.tsx": "Lets users capture a one-time SOS location snapshot and navigate to view their SOS card, with warnings and status handling.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, persisting, and clearing URL parameters across navigation using both URL query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, animations, container settings, and plugins like typography and container-queries.",
  "project_state.json": "Tracks project metadata, existing feature definitions, and pending requests. Describes current app requirements, versions, and project configuration details."
}