{
  "backend/main.mo": "Motoko canister defining user profiles, places, routes, emergency data, SOS snapshots, and authorization‑gated CRUD operations using storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report describing two QR‑removal features, their touched files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of frontend file paths with brief descriptions of each component’s purpose in the app.",
  "frontend/docs/flyer-download-smoke-test.md": "Manual smoke-test checklist for validating flyer download, share dialog export, link sharing, and error handling.",
  "frontend/index.css": "Tailwind CSS base configuration defining light and dark theme color variables and global styles.",
  "frontend/index.html": "HTML entry point loading the root React application via main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining all app routes, layouts, and flyer auto-export search param validation.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when a user lacks permissions, offering navigation back to home.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard that checks admin role and renders a loading state or access denied screen accordingly.",
  "frontend/src/components/auth/AuthenticatedRouteGuard.tsx": "Guards routes by checking for an authenticated Internet Identity and displays a login prompt if absent.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity, handling loading states and query cache clearing.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout with header, optional sidebar navigation for authenticated users, mobile menu, main content, and footer.",
  "frontend/src/components/layout/AppNav.tsx": "Navigation menu that adapts to user role and highlights the current route, triggering navigation callbacks.",
  "frontend/src/components/layout/BrandHeader.tsx": "Top header with branding, share button, optional emergency lookup link, and login control.",
  "frontend/src/components/profile/EmergencyAccessCodeCard.tsx": "Manages creation, display, rotation, and copying of a user's emergency access code and principal ID.",
  "frontend/src/components/profile/EmergencyProfileCard.tsx": "Form for saving next-of-kin and health information tied to the user's emergency access code.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to create a basic profile by entering their name.",
  "frontend/src/components/profile/VerificationUploadsCard.tsx": "Handles file selection, validation, upload progress, and submission of license and ID documents for user verification.",
  "frontend/src/components/share/FlyerPreview.tsx": "Generates a printable preview flyer displaying branding, platform details, and a share URL.",
  "frontend/src/components/share/ShareDialog.tsx": "Provides a dialog for generating, copying, sharing, and navigating to flyer views using a generated app share URL.",
  "frontend/src/components/sos/PublicSOSCardView.tsx": "Displays emergency contact info and last known SOS location for first responders, including map links and timestamps.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities, handling login/logout, and exposing status flags.",
  "frontend/src/hooks/useQrCodeCanvas.ts": "Generates a QR code on a canvas with timeout, abort handling, and status tracking for readiness or errors.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, verification, places, and mutations wrapping backend actor calls.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme CSS variables for light and dark modes.",
  "frontend/src/lib/accessCode.ts": "Generates, stores, retrieves, and clears a random access code in localStorage.",
  "frontend/src/lib/clipboard.ts": "Implements a robust clipboard copy function with secure-context checks and a fallback method.",
  "frontend/src/lib/domToPng.ts": "Empty placeholder file for DOM-to-PNG utilities.",
  "frontend/src/lib/fileValidation.ts": "Validates file size and type and provides a byte-size formatting helper.",
  "frontend/src/lib/flyerExport.ts": "Renders a flyer element onto a canvas and exports it as a PNG with custom drawing logic.",
  "frontend/src/lib/geolocation.ts": "Wraps the browser geolocation API in a Promise and returns coordinates or detailed errors.",
  "frontend/src/lib/placeCategory.ts": "Maps place category enums to labels and provides category lookup helpers.",
  "frontend/src/lib/qr.ts": "Empty placeholder file for QR utilities.",
  "frontend/src/lib/qrCodeGenerator.ts": "Implements a standards-based QR code generator including Galois field math and Reed-Solomon ECC.",
  "frontend/src/lib/qrDownload.ts": "Downloads a canvas as a PNG after validating readiness.",
  "frontend/src/lib/quickShare.ts": "Provides a URL-sharing helper using the Web Share API with clipboard fallback and detailed status results.",
  "frontend/src/lib/shareUrl.ts": "Returns the app’s canonical share URL based on window.location.origin.",
  "frontend/src/lib/time.ts": "Converts between Date and bigint timestamps and formats dates for display.",
  "frontend/src/lib/urlParams.ts": "Utilities to get and remove URL parameters for both query strings and hash-based routing.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider.",
  "frontend/src/pages/AddPlacePage.tsx": "Form page allowing authenticated users to submit a new place with name, category, location, and description.",
  "frontend/src/pages/AddRoutePage.tsx": "Form page for creating and submitting a new route with start, destination, waypoints, and date-time.",
  "frontend/src/pages/AdminReviewPage.tsx": "Admin interface to lookup user profiles and approve or reject verification requests.",
  "frontend/src/pages/EmergencyLookupPage.tsx": "Page for entering a principal and access code to retrieve emergency information for responders.",
  "frontend/src/pages/FlyerPage.tsx": "Generates and downloads a flyer preview, supporting auto-export via URL params and manual export or link copying.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page showing feature highlights and redirecting authenticated users to the places page.",
  "frontend/src/pages/PlaceDetailPage.tsx": "Displays detailed information for a selected place, including category, description, and submitter.",
  "frontend/src/pages/PlacesListPage.tsx": "Lists safe places with search and category filtering plus navigation to add new places.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the user profile and embedded emergency and verification sections behind authentication.",
  "frontend/src/pages/RouteDetailPage.tsx": "Placeholder view for route details with a back button.",
  "frontend/src/pages/RoutesListPage.tsx": "Shows user routes and allows searching routes by principal, with navigation to add new routes.",
  "frontend/src/pages/SOSCardPage.tsx": "Displays the user's emergency SOS card, fetching profile and emergency data and showing a loading or empty state as needed.",
  "frontend/src/pages/SOSPage.tsx": "Provides UI to capture a one-time SOS location snapshot and navigate to the SOS card view.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, animations, and plugins.",
  "project_state.json": "Project metadata describing QR‑related issues, temporary removal requirements, and feature requests."
}