{
  "backend/main.mo": "Defines actor with storage and authorization mixins plus types and CRUD logic for user profiles, places, routes, emergency profiles, and SOS snapshots.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for many frontend source files to aid build analysis.",
  "frontend/docs/flyer-download-smoke-test.md": "Manual smoke‑test checklist for verifying flyer download, QR code quality, fallback handling, and error behavior.",
  "frontend/index.css": "Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, layout, and initialization logic for the entire React app.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with a button to return home.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects admin pages by checking user role and showing loading or access‑denied states.",
  "frontend/src/components/auth/AuthenticatedRouteGuard.tsx": "Guards routes by checking for an authenticated identity and shows a login prompt if missing.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button handling Internet Identity auth and query cache clearing.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, sidebar navigation for authenticated users, mobile menu, and footer.",
  "frontend/src/components/layout/AppNav.tsx": "Renders navigation buttons based on current route and user role, including admin and emergency lookup links.",
  "frontend/src/components/layout/BrandHeader.tsx": "Displays the app header with branding, share button, emergency lookup shortcut, and login button.",
  "frontend/src/components/profile/EmergencyAccessCodeCard.tsx": "Manages generating, viewing, copying, and rotating the user's emergency access code and principal ID.",
  "frontend/src/components/profile/EmergencyProfileCard.tsx": "Form for creating or updating the user's emergency profile containing next of kin and health info.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Shows a setup dialog prompting new authenticated users to enter their name to create a profile.",
  "frontend/src/components/profile/VerificationUploadsCard.tsx": "UI card for uploading license and ID documents with validation, progress tracking, and verification status display.",
  "frontend/src/components/share/FlyerPreview.tsx": "Generates a flyer-style preview with branding, intro text, QR canvas, and fallback error display.",
  "frontend/src/components/share/ShareDialog.tsx": "Dialog for generating, displaying, copying, sharing, and downloading a shareable QR code and link.",
  "frontend/src/components/sos/PublicSOSCardView.tsx": "Public SOS emergency info card showing contacts, health details, and last known location with map link.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, loading identities, and handling login states.",
  "frontend/src/hooks/useQrCodeCanvas.ts": "React hook that renders a QR code to a canvas with abort control, timeout safety, and ready/error state tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profiles, verification, places, and related mutations.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables styled around safety and asphalt color palettes.",
  "frontend/src/lib/accessCode.ts": "Generates, stores, retrieves, and clears a 12‑character access code using localStorage.",
  "frontend/src/lib/clipboard.ts": "Clipboard copy utility that uses the Clipboard API with a fallback to a DOM-based execCommand method.",
  "frontend/src/lib/domToPng.ts": "Empty placeholder file for DOM-to-PNG utilities.",
  "frontend/src/lib/fileValidation.ts": "Validates file size and type and provides a helper to format file sizes.",
  "frontend/src/lib/flyerExport.ts": "Exports a flyer element to a high-resolution PNG by manually rendering content and a QR canvas onto an HTML canvas.",
  "frontend/src/lib/geolocation.ts": "Fetches the user's current geolocation with detailed error handling and high‑accuracy options.",
  "frontend/src/lib/placeCategory.ts": "Maps place category enums to labels and provides utility functions and options for UI usage.",
  "frontend/src/lib/qr.ts": "Empty placeholder file for QR-related utilities.",
  "frontend/src/lib/qrCodeGenerator.ts": "Low-level QR code generator implementing error correction, Galois field math, and module placement per QR spec.",
  "frontend/src/lib/qrDownload.ts": "Provides a function to validate a canvas and download it as a PNG via a blob and temporary link.",
  "frontend/src/lib/quickShare.ts": "Implements Web Share API with clipboard fallback and returns structured status results.",
  "frontend/src/lib/shareUrl.ts": "Returns the app’s canonical share URL using window.location.origin.",
  "frontend/src/lib/time.ts": "Converts dates to bigint timestamps, back to Date, and formats them for display.",
  "frontend/src/lib/urlParams.ts": "Utilities to read and clear URL parameters supporting both query and hash routing.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AddPlacePage.tsx": "Form page for authenticated users to add a place with validation and mutation handling.",
  "frontend/src/pages/AddRoutePage.tsx": "Form page for creating routes, converting date input to bigint time and submitting via mutation.",
  "frontend/src/pages/AdminReviewPage.tsx": "Admin interface to look up users and approve or reject verification requests.",
  "frontend/src/pages/EmergencyLookupPage.tsx": "Page allowing lookup of emergency information using a principal ID and access code.",
  "frontend/src/pages/FlyerPage.tsx": "Generates a shareable flyer with QR code, supports auto-exporting and manual PNG download, and provides link copy functionality.",
  "frontend/src/pages/LandingPage.tsx": "Landing page that redirects authenticated users and showcases feature cards for the platform.",
  "frontend/src/pages/PlaceDetailPage.tsx": "Displays detailed information for a selected place, including category, description, and submitter.",
  "frontend/src/pages/PlacesListPage.tsx": "Lists safe places with search and category filters and allows authenticated users to add new places.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the user's profile with verification, emergency info, and access code management components.",
  "frontend/src/pages/RouteDetailPage.tsx": "Placeholder page showing minimal route detail with navigation back to the routes list.",
  "frontend/src/pages/RoutesListPage.tsx": "Displays the user’s routes, allows searching routes by principal, and links to add new routes.",
  "frontend/src/pages/SOSCardPage.tsx": "Displays the user's SOS card, fetching emergency profile data and showing loading, card view, or a prompt to set up a profile.",
  "frontend/src/pages/SOSPage.tsx": "Provides UI to capture a one-time SOS location snapshot and navigate to view the SOS card.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, versioning, architectural notes, known issues, and existing feature definitions for build planning."
}