{
  "backend/main.mo": "Motoko canister defining user profiles, places, routes, emergency data, SOS snapshots, meetup locations, and access-controlled CRUD operations using storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs for map zoom preference and shared URL utilities.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files covering hooks, components, utilities, and pages.",
  "frontend/docs/flyer-download-smoke-test.md": "Manual smoke‑test checklist describing steps and expected results for flyer download and share functionality.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark mode tokens, and base styling rules.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, global layout, theme provider, and profile setup dialog for the frontend app.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen showing an access‑denied message with navigation back to the home page.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard that checks caller admin role and displays loading or access‑denied UI before rendering protected content.",
  "frontend/src/components/auth/AuthenticatedRouteGuard.tsx": "Guards routes by checking Internet Identity; shows login card if unauthenticated or renders children otherwise.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders login/logout button that handles Internet Identity auth flow and clears cached queries on logout.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, optional sidebar/mobile nav for authenticated users, content area, and footer.",
  "frontend/src/components/layout/AppNav.tsx": "Sidebar navigation listing app routes and conditionally showing admin and emergency lookup links based on user role.",
  "frontend/src/components/layout/BrandHeader.tsx": "Top header with branding, share button, emergency lookup access, and login controls.",
  "frontend/src/components/maps/MapZoomControl.tsx": "Control for selecting preferred map zoom level and storing it in user preferences.",
  "frontend/src/components/profile/EmergencyAccessCodeCard.tsx": "Manages generating, viewing, copying, and rotating an emergency access code tied to the user's principal.",
  "frontend/src/components/profile/EmergencyProfileCard.tsx": "Form for saving emergency profile details using a stored access code, with validation and mutation handling.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Shows a dialog for new authenticated users to enter their name and create a profile.",
  "frontend/src/components/profile/VerificationUploadsCard.tsx": "Lets users upload and track progress of license and ID verification files, showing current verification status.",
  "frontend/src/components/share/FlyerPreview.tsx": "Displays a printable flyer preview promoting the platform and showing a shareable URL.",
  "frontend/src/components/share/ShareDialog.tsx": "Provides a dialog to copy, share, or view/download a flyer containing the generated app share link.",
  "frontend/src/components/sos/LastKnownLocationCard.tsx": "Shows the SOS snapshot’s timestamp and coordinates with a link to view the location on Google Maps.",
  "frontend/src/components/sos/PublicSOSCardView.tsx": "Displays emergency contacts, optional driver details, and last known SOS location for first responders.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and status tracking.",
  "frontend/src/hooks/useQrCodeCanvas.ts": "React hook that generates QR codes onto a canvas with abort handling, timeout protection, and ready/error state tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods, including user profile, role, admin actions, and verification workflows.",
  "frontend/src/index.css": "Tailwind CSS configuration defining light/dark theme variables and custom component styles for the UI.",
  "frontend/src/lib/accessCode.ts": "Generates, stores, retrieves, and clears a 12‑character access code in localStorage.",
  "frontend/src/lib/clipboard.ts": "Implements a resilient clipboard copy function with secure-context checks and a DOM fallback method.",
  "frontend/src/lib/domToPng.ts": "Empty placeholder file for DOM‑to‑PNG functionality.",
  "frontend/src/lib/fileValidation.ts": "Validates file size and type for uploads and provides a helper to format file sizes.",
  "frontend/src/lib/flyerExport.ts": "Renders a flyer DOM element into a high‑resolution PNG using manual canvas drawing for compatibility.",
  "frontend/src/lib/geolocation.ts": "Wraps browser geolocation API to return current coordinates with error handling and timeouts.",
  "frontend/src/lib/googleMapsUrl.ts": "Builds Google Maps URLs from latitude/longitude with optional zoom parameters.",
  "frontend/src/lib/mapZoomPreference.ts": "Manages storing, retrieving, and clamping map zoom levels in localStorage.",
  "frontend/src/lib/meetupShareCode.ts": "Generates an 8‑character meetup share code and provides localStorage persistence utilities.",
  "frontend/src/lib/placeCategory.ts": "Maps place category enums to labels and builds select options, with a helper to get labels.",
  "frontend/src/lib/principal.ts": "Validates and safely parses Dfinity Principal IDs from text.",
  "frontend/src/lib/qr.ts": "Empty placeholder module for QR-related utilities.",
  "frontend/src/lib/qrCodeGenerator.ts": "Implements a QR code generator with Reed‑Solomon error correction and module pattern rendering.",
  "frontend/src/lib/qrDownload.ts": "Provides a function to download a canvas element as a PNG with basic validation.",
  "frontend/src/lib/quickShare.ts": "Implements Web Share API handling with clipboard fallback and structured status results.",
  "frontend/src/lib/shareUrl.ts": "Returns the canonical base URL for sharing using window.location.origin.",
  "frontend/src/lib/time.ts": "Converts between Date and bigint microsecond timestamps and formats dates.",
  "frontend/src/lib/urlParams.ts": "Adds utilities to get and remove URL parameters supporting both query and hash routing.",
  "frontend/src/main.tsx": "Entry point that sets up React, QueryClient, and Internet Identity provider before rendering App.",
  "frontend/src/pages/AddPlacePage.tsx": "Form page allowing authenticated users to add a place with category, location, and description.",
  "frontend/src/pages/AddRoutePage.tsx": "Form page for creating a route with start, destination, waypoints, date/time, and notes.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard with tabs for registrations, verification review, and SOS locations, using multiple query hooks and action handlers.",
  "frontend/src/pages/AdminReviewPage.tsx": "Empty page file with no implementation.",
  "frontend/src/pages/EmergencyLookupPage.tsx": "Emergency lookup interface where responders enter a principal ID and access code to view SOS or emergency profile data.",
  "frontend/src/pages/FlyerPage.tsx": "Page to preview, copy, and export a shareable flyer, including optional auto-export behavior.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page showing app features and redirecting authenticated users to Places.",
  "frontend/src/pages/MeetupPage.tsx": "Lets users share and look up live meetup locations with periodic updates, codes, and map tools.",
  "frontend/src/pages/PlaceDetailPage.tsx": "Displays detailed information about a selected place from search results, including category, description, and submitter.",
  "frontend/src/pages/PlacesListPage.tsx": "Lists safe places with category filtering, text search, and navigation to add a new place. Displays loading, empty state, and filtered results.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the user's profile with loading state and includes verification, emergency access code, and emergency profile cards. Uses auth guard to restrict access.",
  "frontend/src/pages/RouteDetailPage.tsx": "Placeholder page showing a simple route detail view with a back button.",
  "frontend/src/pages/RoutesListPage.tsx": "Displays the user's routes and allows searching routes by principal ID, with loading, empty states, and navigation to add a route.",
  "frontend/src/pages/SOSCardPage.tsx": "Fetches and displays the user's emergency SOS card or prompts setup if none exists, with navigation back to the SOS page.",
  "frontend/src/pages/SOSPage.tsx": "Allows users to capture a one-time SOS location snapshot and navigate to view their SOS card. Includes warnings, loading states, and error handling.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session parameters, supporting hash-based and standard query routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and container settings while loading typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata describing features, known issues, and pending requests for a project using versioned schema tracking."
}