{
  "kind": "build_request",
  "title": "Fix Share QR code so it encodes the app link and scans reliably",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "Make the generated QR code standards-compliant so that common phone camera QR scanners detect and display the encoded app URL (the canonical share URL from getShareUrl()), in both the Share dialog and the Flyer page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "The QR code does not show a link when camera is focused. There is nothing in the upper qr code box/ link. It is blank."
        ]
      },
      "acceptanceCriteria": [
        "Opening the Share dialog shows a QR code that can be scanned by a standard phone camera QR scanner and resolves to the same URL shown in the “App Link” input.",
        "Opening the Flyer page shows a QR code that can be scanned by a standard phone camera QR scanner and resolves to the same URL shown in the “App Link” input.",
        "The QR code includes an adequate quiet zone so scanners can reliably detect it (especially when printed or viewed on another screen).",
        "QR generation remains fully client-side (no external QR API dependency)."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Update QR rendering logic so QR generation is triggered reliably after the canvas element is mounted/available, avoiding cases where the dialog/page opens but the QR is not generated or is generated on a zero/incorrect canvas state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "The QR code does not show a link when camera is focused. There is nothing in the upper qr code box/ link. It is blank."
        ]
      },
      "acceptanceCriteria": [
        "When the Share dialog is opened repeatedly (open/close/open), the QR code consistently appears and remains scannable each time.",
        "When navigating to /flyer, the QR code consistently appears and is scannable without requiring a refresh.",
        "If QR generation fails for any reason, a clear English error toast is shown and the UI does not claim the QR is ready."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Ensure all share-related user-facing error messages for QR generation and QR downloading remain in English and clearly communicate what the user should do next (wait, retry, or use Copy Link).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Use English for any user-facing text in the build request."
        ]
      },
      "acceptanceCriteria": [
        "All QR/share failure toasts and inline status text related to QR readiness are in English.",
        "If QR is not ready, actions that depend on it (e.g., Download QR) provide a clear English message instructing the user to wait or retry."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (compose existing UI components instead).",
    "Keep QR generation fully client-side; do not call any external QR generation service."
  ],
  "nonGoals": [
    "Do not change the canonical share URL behavior beyond what is necessary for the QR to encode the correct URL.",
    "Do not add new sharing features (only fix QR scan/link detection reliability).",
    "Do not modify backend canister logic; this issue should be addressed in frontend QR generation/rendering."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}