{
  "kind": "build_request",
  "title": "Add user-adjustable map link controls (zoom) for Google Maps links",
  "projectName": "My Brother's Keeper",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a user-facing control to fine-tune Google Maps link behavior by allowing the user to set a preferred zoom level (with a sensible default) and persist that preference locally (e.g., localStorage) so it is reused across sessions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Fine tune the map please",
          "Finne tune it"
        ]
      },
      "acceptanceCriteria": [
        "A zoom control is available in the UI where map links are shown (at minimum on the Meetup location result panel).",
        "The selected zoom value persists across page reloads (stored locally in the browser).",
        "A default zoom is used when the user has not set a preference.",
        "User-facing text is in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update all existing Google Maps links in the app that open coordinates to use the preferred zoom level when generating the URL (including MeetupPage and the SOS last-known-location view).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Fine tune the map please"
        ]
      },
      "acceptanceCriteria": [
        "MeetupPage map link(s) include the zoom parameter and reflect the user-selected zoom value.",
        "LastKnownLocationCard “View on Google Maps” link includes the zoom parameter and reflects the user-selected zoom value.",
        "If the preference is unset, links use the app’s default zoom."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Refactor map URL generation into a shared frontend utility so all map links are consistent and easy to adjust in one place (e.g., a single function that takes latitude, longitude, and optional zoom).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Fine tune the map please"
        ]
      },
      "acceptanceCriteria": [
        "There is a single shared utility used by both MeetupPage and LastKnownLocationCard to build Google Maps URLs.",
        "No duplicate ad-hoc string templates for Google Maps URLs remain in the updated areas."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not edit immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Do not embed an interactive map widget (e.g., Google Maps iframe/SDK); keep the existing behavior of opening Google Maps in a new tab.",
    "Do not add any backend changes or persist map preferences on-chain."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}