{
  "kind": "build_request",
  "title": "Fix Flyer PNG export (remove tainted-canvas foreignObject approach)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-35",
      "text": "Replace the current flyer PNG export implementation in frontend/src/lib/flyerExport.ts to avoid the SVG <foreignObject> approach (which causes \"Tainted canvases may not be exported\" on mobile) and implement a cross-browser DOM-to-image export that works on iOS and Android.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Yes fix the flyer export"
        ]
      },
      "acceptanceCriteria": [
        "Clicking “Download Flyer” on /flyer produces a downloaded PNG file on mobile browsers (Android Chrome and iOS Safari) without throwing a tainted-canvas/toBlob error.",
        "The export implementation does not use SVG <foreignObject> to render the flyer DOM.",
        "The exported PNG contains the full flyer content (title, intro text, QR code area, and the share URL text) at readable resolution."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Ensure the flyer export includes the rendered QR code reliably (matching what the user sees in the flyer preview), and does not depend on any cross-origin images/fonts that can taint the export canvas.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "\"Failed to execute 'toBlob' on 'HTMLCanvasElement': Tainted canvases may not be exported\"",
          "Yes fix the flyer export"
        ]
      },
      "acceptanceCriteria": [
        "The exported flyer PNG includes a visible QR code (not blank, not missing).",
        "Export succeeds even when triggered via the Share dialog “Download Flyer” (auto-export flow) and when triggered directly from the Flyer page.",
        "If any asset would cause tainting, the exporter either inlines it safely or excludes/replaces it so export still succeeds (no taint error)."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Keep all flyer-download user-facing error messages in clear English and update them where needed to reflect the new export flow (including actionable next steps like retrying or using Copy Link).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "Failed to download flyer: Failed to execute 'toBlob' on 'HTMLCanvasElement': Tainted canvases may not be exported",
          "Yes fix the flyer export"
        ]
      },
      "acceptanceCriteria": [
        "When flyer download fails for any reason, the user sees an English toast/message that clearly indicates what happened and what to do next (e.g., wait and retry, or use “Copy Link”).",
        "No raw/technical browser exception text (e.g., “foreignObject”, “tainted canvases”) is shown directly to end users unless it is wrapped with a friendly explanation."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Perform a production smoke-test pass specifically for flyer downloading: (1) Flyer page “Download Flyer”, (2) Share dialog “Download Flyer” auto-export navigation, verifying that downloads trigger and files are not empty/blank.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Yes fix the flyer export"
        ]
      },
      "acceptanceCriteria": [
        "Manual verification checklist is completed: Flyer downloads correctly from /flyer and from the Share dialog auto-export flow.",
        "No regression to QR generation, share URL display, or copy-link behavior on the flyer page."
      ]
    }
  ],
  "constraints": [
    "Frontend paths listed in frontend.immutablePaths must not be edited.",
    "Do not introduce any backend changes for flyer export; this fix must remain fully client-side.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new flyer content/sections beyond what is required to fix export reliability.",
    "Changing the QR generation algorithm or share URL selection (except as required to ensure the exported flyer matches the on-screen flyer and downloads reliably).",
    "Implementing new authentication or data storage features as part of this fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}