{
  "kind": "build_request",
  "title": "Refine Meetup Location View (sharing + lookup UX fixes)",
  "projectName": "My Brother's Keeper",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the meetup location lookup flow so that the entered meetup code is actually used to validate the fetched location, instead of using the locally stored share code.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes please"
        ]
      },
      "acceptanceCriteria": [
        "On the Meetup page, entering a Member's Principal ID and a Meetup Share Code and clicking “Find Location” uses the entered meetup code to validate the returned location (e.g., compares returned location.name to the entered code).",
        "Lookup works even when the current user has a different locally stored meetup share code in localStorage.",
        "The lookup query cache key varies by both Principal ID and entered code so changing either input triggers a new lookup result (no stale results carried over)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve meetup lookup UX and error handling: validate Principal ID format before lookup, show clear inline errors, and ensure lookupCode is required for lookup.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes please"
        ]
      },
      "acceptanceCriteria": [
        "If the Principal ID is not a valid textual Principal, the UI shows an inline validation message and does not start the lookup request.",
        "If either Principal ID or Meetup Share Code is empty, the UI prevents lookup and shows a clear user-facing message (toast and/or inline error).",
        "If no active location is found (or code mismatch), the UI shows a clear “No active location found / code incorrect” message without throwing console errors."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Refine the location result panel to make the found meetup location easier to use: show last-updated time clearly, provide a one-click Google Maps link, and provide a copy-to-clipboard action for coordinates and/or the Maps URL.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes please"
        ]
      },
      "acceptanceCriteria": [
        "When a location is found, the result card displays the last updated timestamp in a readable format and the latitude/longitude values.",
        "The “View on Google Maps” button opens a new tab with a valid Google Maps URL for the returned coordinates.",
        "The result card includes at least one copy action (coordinates or Maps URL) and shows a success confirmation when copied."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Refine the sharing status panel to better communicate current state: show a clear active/inactive indicator, show last successful update time, and show a clear error state if periodic updates fail (including stopping sharing if updates fail).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes please"
        ]
      },
      "acceptanceCriteria": [
        "When sharing is active, the UI shows an obvious “Sharing Active” status and shows the last successful update time.",
        "If an update fails during periodic sharing, sharing stops and the UI reflects the stopped state (no interval continues running).",
        "User-facing error messages are in English and are actionable (e.g., mention location permission issues when relevant)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Keep backend as a single Motoko actor in backend/main.mo; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not add third-party map SDKs or an embedded interactive map view (continue using external map links).",
    "Do not add real-time features requiring WebSockets or push notifications.",
    "Do not change the meetup backend data model unless strictly required to support the above UI fixes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}