{
  "kind": "build_request",
  "title": "Fix QR codes so phone cameras recognize and open the app link",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-39",
      "text": "Fix the client-side QR code generation so that the QR codes rendered in the Share dialog and Flyer page are standards-compliant and reliably scannable/decodable by common phone camera QR scanners (iOS and Android), showing the encoded app link as a tappable URL.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "When I point the camera towards it nothing pops up for a link on the phones screen but the QR code is present."
        ]
      },
      "acceptanceCriteria": [
        "From the Share dialog QR canvas, scanning with an iPhone Camera app shows the encoded app URL and allows tapping to open it.",
        "From the Flyer page QR canvas, scanning with an iPhone Camera app shows the encoded app URL and allows tapping to open it.",
        "From the Share dialog QR canvas, scanning with a typical Android camera QR scanner shows the encoded app URL and allows tapping to open it.",
        "From the Flyer page QR canvas, scanning with a typical Android camera QR scanner shows the encoded app URL and allows tapping to open it.",
        "The encoded content matches the canonical share URL returned by getShareUrl() (frontend/src/lib/shareUrl.ts).",
        "The fix applies without reintroducing any dependency on external QR generation services."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Add clear, English, user-facing error handling and recovery guidance specifically for the case where a QR code is rendered but cannot be scanned, including an obvious fallback path to share via the displayed App Link (copy/share) without implying the user’s phone is at fault.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "When I point the camera towards it nothing pops up for a link on the phones screen but the QR code is present."
        ]
      },
      "acceptanceCriteria": [
        "If QR generation fails or produces an unusable result, the UI provides an English message that recommends using “Copy Link” / the App Link field as the fallback.",
        "All new/updated messages in ShareDialog.tsx and FlyerPage.tsx remain in English and match the app’s existing safety-focused tone.",
        "No infinite loading state is introduced; the QR area must either reach a ready state or show an actionable error state."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only).",
    "Keep all QR generation fully client-side (no external QR server/API).",
    "Use English for any new or updated user-facing text."
  ],
  "nonGoals": [
    "Backend/canister changes.",
    "Adding live tracking or any new sharing destinations beyond fixing QR scannability.",
    "Changing the canonical share URL behavior beyond ensuring the QR encodes getShareUrl() output."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}