{
  "kind": "build_request",
  "title": "Temporarily remove QR code from Share and Flyer flows (keep link sharing)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Share dialog to temporarily remove/disable the QR code feature while keeping the rest of the dialog functionality unchanged (App Link display, Copy Link, and Quick Share). Specifically: remove QR canvas rendering and the QR generation hook usage; remove or disable the “Download QR” action; and update the dialog description/tip text so it no longer instructs users to scan a QR code and instead directs them to share via the app link.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The QR code isn't working. I have tried it a couple times. I like everything else. If it isn't going to work right now we can remove it and try it again at a later date, correct?"
        ]
      },
      "acceptanceCriteria": [
        "Opening the Share dialog no longer shows a QR canvas or any “Generating QR code…” / QR error overlay states.",
        "The Share dialog still shows the App Link field populated with the canonical share URL and allows the user to copy it.",
        "Quick Share still works as before (including existing error handling) and remains enabled when a share URL exists.",
        "There is no “Download QR” button/action available in the Share dialog (removed or clearly disabled with no QR dependency).",
        "All Share dialog user-facing text is in English and does not reference scanning a QR code."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Flyer experience to temporarily remove/disable QR code generation and rendering, while keeping the flyer page usable and downloadable. Specifically: remove the QR canvas from the flyer preview UI, remove QR generation state handling (ready/generating/error gating), and adjust the flyer export implementation so it can export a flyer PNG without requiring a QR canvas (the exported flyer should still include the app title/branding and the share URL).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "If it isn't going to work right now we can remove it and try it again at a later date, correct?"
        ]
      },
      "acceptanceCriteria": [
        "The Flyer page no longer attempts to generate a QR code and no longer displays QR-specific UI (canvas, generating state, QR error state, scanning tips).",
        "The flyer preview still displays the share URL clearly.",
        "“Download Flyer” works without waiting for any QR-ready state and produces a non-empty PNG download.",
        "Auto-export download (navigation to /flyer with autoExportFlyer=1) completes without requiring a QR canvas and clears the URL parameter afterward as it does today.",
        "All flyer-related user-facing text is in English and does not instruct users to scan a QR code."
      ]
    }
  ],
  "constraints": [
    "Do not modify any frontend files under frontend/src/components/ui or any paths listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Do not add new backend services or external dependencies; keep the application on the existing stack."
  ],
  "nonGoals": [
    "Do not fix or improve the QR code generator/encoding behavior in this change (QR will be revisited later).",
    "Do not change backend canister logic or data schemas as part of this QR removal.",
    "Do not redesign unrelated parts of the app; only adjust Share/Flyer content as needed to remove QR references."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}