{
  "kind": "build_request",
  "title": "Add Admin Dashboard (registrations overview) and clarify sharing requires no new app download",
  "projectName": "My Brother's Keeper",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add an admin dashboard page that allows admins to view a list of registered users (registrations) in the app UI.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I would like to add an admin dashboard."
        ]
      },
      "acceptanceCriteria": [
        "An admin-only page exists (reachable from the in-app navigation for admins) that displays a table/list of registered users.",
        "The registrations list includes, at minimum: user principal, user name (if available), and verification status.",
        "Non-admin users attempting to access the admin dashboard route are shown the existing access denied screen.",
        "The registrations list loads from the backend via a dedicated admin-gated API, not hardcoded data.",
        "Errors from the backend are surfaced in the UI with a clear English error message."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Extend the backend to support admin-gated retrieval of registrations (registered user profiles) needed by the admin dashboard.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I would like to add an admin dashboard."
        ]
      },
      "acceptanceCriteria": [
        "A new admin-only backend method exists that returns a list of user registrations derived from stored user profiles.",
        "The method traps/denies access when called by a non-admin principal.",
        "The method returns stable, deterministic data for a given state (e.g., consistent ordering such as by name or principal)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the existing admin area UI so it reads as a single “Admin Dashboard” experience (with the current Admin Review functionality still available), and update admin navigation labeling accordingly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I would like to add an admin dashboard."
        ]
      },
      "acceptanceCriteria": [
        "Admin navigation entry text is updated to “Admin Dashboard” (or equivalent) while still linking to the admin area.",
        "The existing verification review workflow remains accessible for admins (no regression in lookup, approve, reject).",
        "The admin area provides a clear way to switch between “Registrations” and “Verification Review” (e.g., tabs/sections), without requiring manual URL edits."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add user-facing copy (in the Share dialog and the Flyer page) clarifying that recipients/subscribers can use the same shared link and do not need to download a separate app to access/register.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I have sent this version to some potential subscribers will they have to use another app download?"
        ]
      },
      "acceptanceCriteria": [
        "Share dialog includes a short English note stating that recipients can open the shared link and do not need to download another app.",
        "Flyer page includes the same clarification in its “Sharing Tips” (or equivalent) section.",
        "The added copy does not mention draft vs production and does not instruct users to install anything."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not modify frontend immutable hook files (frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "Building a separate native mobile app (iOS/Android) or app-store distribution.",
    "Adding third-party analytics/tracking of subscribers beyond showing registrations already stored in the canister.",
    "Adding new authentication providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}