{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Temporarily disable QR code in Share dialog and Flyer flows while preserving link sharing and downloads",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove QR canvas generation/rendering and QR download action from the Share dialog while keeping App Link display, Copy Link, and Quick Share unchanged, and update user-facing text to reference sharing via the app link.",
      "acceptanceCriteria": [
        "Opening the Share dialog no longer shows a QR canvas or any “Generating QR code…” / QR error overlay states.",
        "The Share dialog still shows the App Link field populated with the canonical share URL and allows the user to copy it.",
        "Quick Share still works as before (including existing error handling) and remains enabled when a share URL exists.",
        "There is no “Download QR” button/action available in the Share dialog (removed or clearly disabled with no QR dependency).",
        "All Share dialog user-facing text is in English and does not reference scanning a QR code."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/share/ShareDialog.tsx",
          "operation": "modify",
          "description": "Remove QR-related imports/state (useQrCodeCanvas, canvas ref/state, qrReady/qrError/status), remove QR canvas block and generating/error overlays, remove scanning tip copy, and remove the “Download QR” button/action. Update dialog description/tip text to direct users to share via the App Link. Ensure “Download Flyer” is no longer gated on QR readiness and remains enabled when a share URL exists; keep Copy Link + Quick Share behavior and existing error handling intact. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove QR generation/rendering from the Flyer page and preview while keeping the flyer preview readable and the flyer PNG export (including branding and share URL) working without QR readiness gating, including auto-export behavior.",
      "acceptanceCriteria": [
        "The Flyer page no longer attempts to generate a QR code and no longer displays QR-specific UI (canvas, generating state, QR error state, scanning tips).",
        "The flyer preview still displays the share URL clearly.",
        "“Download Flyer” works without waiting for any QR-ready state and produces a non-empty PNG download.",
        "Auto-export download (navigation to /flyer with autoExportFlyer=1) completes without requiring a QR canvas and clears the URL parameter afterward as it does today.",
        "All flyer-related user-facing text is in English and does not instruct users to scan a QR code."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/FlyerPage.tsx",
          "operation": "modify",
          "description": "Remove QR canvas ref/state and useQrCodeCanvas usage, eliminate qrReady/generating/error gating and any QR-related toasts/UI. Update manual download and auto-export logic to export as soon as the flyer ref + shareUrl are available (no QR dependency), and keep clearing autoExportFlyer afterward. Ensure the preview still shows the share URL and the download produces a non-empty PNG. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/share/FlyerPreview.tsx",
          "operation": "modify",
          "description": "Remove the QR section entirely (canvas, generating overlay, error overlay, scan-to-join headings, scanning tips). Update props to no longer require qrCanvasRef/isGenerating/qrError, and ensure the preview continues to present app branding and the share URL clearly in the layout. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/flyerExport.ts",
          "operation": "modify",
          "description": "Adjust flyer export implementation to no longer require a QR canvas and to not render any QR-related text/graphics. Update the export function signature and rendering to include app branding plus the provided share URL text in the exported PNG. Ensure export still produces a non-empty PNG and maintains existing user-friendly error handling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/docs/flyer-download-smoke-test.md",
          "operation": "modify",
          "description": "Update the manual smoke-test checklist to remove QR-generation and QR-scanning expectations, and replace with checks for share URL visibility, successful manual download, and successful auto-export (autoExportFlyer=1) producing a non-empty PNG with branding + URL. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}