{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Dashboard (registrations overview) + sharing copy clarification",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an admin-only dashboard view that loads and displays registrations (stored user profiles) from the backend in a table/list with clear error handling.",
      "acceptanceCriteria": [
        "An admin-only page exists (reachable from the in-app navigation for admins) that displays a table/list of registered users.",
        "The registrations list includes, at minimum: user principal, user name (if available), and verification status.",
        "Non-admin users attempting to access the admin dashboard route are shown the existing access denied screen.",
        "The registrations list loads from the backend via a dedicated admin-gated API, not hardcoded data.",
        "Errors from the backend are surfaced in the UI with a clear English error message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query hook for the admin registrations list that calls the backend capability for retrieving all user profiles (registrations) and exposes loading/error state. Ensure it is enabled only when an actor is available. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "create",
          "description": "Create an Admin Dashboard page (guarded with AuthenticatedRouteGuard + AdminRouteGuard) with a “Registrations” section that renders a table/list of registrations from the new admin registrations hook, showing principal, name (fallback when missing), and verification status. Surface backend failures as a clear English message (and/or toast) and provide an empty state when no registrations exist. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the admin dashboard page into routing by updating the existing /admin route to render the new AdminDashboardPage. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Unify the admin area into a single Admin Dashboard experience with in-page switching between Registrations and Verification Review, and update admin navigation labeling.",
      "acceptanceCriteria": [
        "Admin navigation entry text is updated to “Admin Dashboard” (or equivalent) while still linking to the admin area.",
        "The existing verification review workflow remains accessible for admins (no regression in lookup, approve, reject).",
        "The admin area provides a clear way to switch between “Registrations” and “Verification Review” (e.g., tabs/sections), without requiring manual URL edits."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminReviewPage.tsx",
          "operation": "modify",
          "description": "Refactor the existing admin review page into a reusable “Verification Review” section component (or exportable child) that can be embedded within the new AdminDashboardPage without duplicating route guards, while preserving lookup + approve + reject behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add a clear in-page switch between “Registrations” and “Verification Review” (e.g., tabs/segmented controls) and embed the refactored verification review UI as the second section, keeping the overall experience labeled as “Admin Dashboard”. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppNav.tsx",
          "operation": "modify",
          "description": "Update the admin navigation item label from “Admin Review” to “Admin Dashboard” while keeping it routed to /admin for admins. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add user-facing copy clarifying that recipients can use the shared link and do not need to download a separate app, in both Share dialog and Flyer page.",
      "acceptanceCriteria": [
        "Share dialog includes a short English note stating that recipients can open the shared link and do not need to download another app.",
        "Flyer page includes the same clarification in its “Sharing Tips” (or equivalent) section.",
        "The added copy does not mention draft vs production and does not instruct users to install anything."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/share/ShareDialog.tsx",
          "operation": "modify",
          "description": "Update the Share dialog copy to include a short clarification that recipients can open the shared link and do not need to download another app. Keep the wording simple and avoid mentioning draft/production or instructing installs. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/FlyerPage.tsx",
          "operation": "modify",
          "description": "Update the Flyer page “Sharing Tips” section to include the same clarification that recipients can use the shared link and do not need to download another app, without mentioning draft/production or installation steps. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}