{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix flyer PNG export for mobile (remove foreignObject, ensure QR renders, improve errors)",
  "requirements": [
    {
      "id": "REQ-35",
      "summary": "Replace the flyer PNG export implementation to avoid SVG foreignObject and use a cross-browser DOM-to-image approach that works on iOS/Android.",
      "acceptanceCriteria": [
        "Clicking “Download Flyer” on /flyer produces a downloaded PNG file on mobile browsers (Android Chrome and iOS Safari) without throwing a tainted-canvas/toBlob error.",
        "The export implementation does not use SVG <foreignObject> to render the flyer DOM.",
        "The exported PNG contains the full flyer content (title, intro text, QR code area, and the share URL text) at readable resolution."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/flyerExport.ts",
          "operation": "modify",
          "description": "Replace the current SVG foreignObject-based rendering with a DOM-to-image export that rasterizes the flyer element reliably on iOS/Android (e.g., via html2canvas or equivalent DOM snapshot technique), including high-DPI scaling, background handling, and a safe download trigger (avoid mobile toBlob pitfalls by supporting a fallback download mechanism when needed)."
        },
        {
          "path": "frontend/src/lib/domToPng.ts",
          "operation": "create",
          "description": "Add a small utility wrapper for DOM-to-PNG capture used by flyer export (configure scale, background color, and safe defaults; ensure it does not rely on SVG foreignObject)."
        },
        {
          "path": "frontend/package.json",
          "operation": "create",
          "description": "Add/declare the required client-side DOM snapshot dependency used by the new exporter (e.g., html2canvas or another cross-browser DOM renderer) and ensure it is available to the frontend build."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Ensure flyer export reliably includes the rendered QR code and avoids cross-origin assets that can taint the export canvas.",
      "acceptanceCriteria": [
        "The exported flyer PNG includes a visible QR code (not blank, not missing).",
        "Export succeeds even when triggered via the Share dialog “Download Flyer” (auto-export flow) and when triggered directly from the Flyer page.",
        "If any asset would cause tainting, the exporter either inlines it safely or excludes/replaces it so export still succeeds (no taint error)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/flyerExport.ts",
          "operation": "modify",
          "description": "Update export flow to clone/sanitize the flyer DOM before capture: inline/replace the on-screen QR canvas with an inlined data URL image derived from the existing QR canvas (so exported output matches preview), and apply a taint-avoidance strategy for any potentially cross-origin assets (e.g., exclude/replace external images, prefer system fonts, avoid loading remote resources during capture)."
        },
        {
          "path": "frontend/src/pages/FlyerPage.tsx",
          "operation": "modify",
          "description": "Tighten readiness gating for both manual download and auto-export (Share dialog navigation): wait for qrReady plus next-frame/layout stability before calling export, and ensure the same exporter is used for both flows."
        },
        {
          "path": "frontend/src/components/share/FlyerPreview.tsx",
          "operation": "modify",
          "description": "Ensure the flyer preview markup is export-friendly: avoid introducing any cross-origin images/fonts in the flyer content and keep QR area predictable for the exporter (e.g., stable container sizing)."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Update flyer download failure messages to be clear English with actionable next steps, without raw technical exception text.",
      "acceptanceCriteria": [
        "When flyer download fails for any reason, the user sees an English toast/message that clearly indicates what happened and what to do next (e.g., wait and retry, or use “Copy Link”).",
        "No raw/technical browser exception text (e.g., “foreignObject”, “tainted canvases”) is shown directly to end users unless it is wrapped with a friendly explanation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/FlyerPage.tsx",
          "operation": "modify",
          "description": "Replace current flyer download error toasts to avoid dumping raw exception messages; map known failure types (not ready, capture failed, download blocked) to friendly English text with next steps (retry, wait for QR, or use Copy Link)."
        },
        {
          "path": "frontend/src/lib/flyerExport.ts",
          "operation": "modify",
          "description": "Normalize/translate low-level export errors into user-safe Error messages (English) so UI can show consistent, non-technical copy while still logging the raw error to console for debugging."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Add a production smoke-test checklist for flyer downloading (Flyer page and Share dialog auto-export) to validate downloads are non-blank and no regressions occur.",
      "acceptanceCriteria": [
        "Manual verification checklist is completed: Flyer downloads correctly from /flyer and from the Share dialog auto-export flow.",
        "No regression to QR generation, share URL display, or copy-link behavior on the flyer page."
      ],
      "file_operations": [
        {
          "path": "frontend/docs/flyer-download-smoke-test.md",
          "operation": "create",
          "description": "Add a concise manual production smoke-test checklist covering: (1) /flyer “Download Flyer”, (2) Share dialog “Download Flyer” auto-export navigation, plus validations for QR visibility, share URL text presence, and non-empty PNG output on Android Chrome and iOS Safari."
        },
        {
          "path": "frontend/src/pages/FlyerPage.tsx",
          "operation": "modify",
          "description": "Add lightweight developer-facing console logs (non-user-facing) around auto-export and manual export start/success/failure to support the documented smoke-test steps and troubleshooting without exposing technical details in toasts."
        }
      ]
    }
  ]
}