{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Standards-compliant client-side QR codes with scan-failure fallback guidance",
  "requirements": [
    {
      "id": "REQ-39",
      "summary": "Make Share dialog and Flyer page QR canvases encode the canonical app URL as a standards-compliant QR that reliably scans on iOS/Android cameras.",
      "acceptanceCriteria": [
        "From the Share dialog QR canvas, scanning with an iPhone Camera app shows the encoded app URL and allows tapping to open it.",
        "From the Flyer page QR canvas, scanning with an iPhone Camera app shows the encoded app URL and allows tapping to open it.",
        "From the Share dialog QR canvas, scanning with a typical Android camera QR scanner shows the encoded app URL and allows tapping to open it.",
        "From the Flyer page QR canvas, scanning with a typical Android camera QR scanner shows the encoded app URL and allows tapping to open it.",
        "The encoded content matches the canonical share URL returned by getShareUrl() (frontend/src/lib/shareUrl.ts).",
        "The fix applies without reintroducing any dependency on external QR generation services."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/qrCodeGenerator.ts",
          "operation": "modify",
          "description": "Replace the current simplified QR implementation with a QR-spec-compliant implementation (proper byte-mode bitstream, version selection by byte capacity, error correction encoding, masking selection, and format information), and render with a reliable quiet zone so the resulting canvas QR is consistently decodable by common iOS/Android camera scanners."
        },
        {
          "path": "frontend/src/hooks/useQrCodeCanvas.ts",
          "operation": "modify",
          "description": "Harden canvas rendering for scanner reliability (e.g., ensure crisp module edges by disabling canvas image smoothing and handling devicePixelRatio scaling) and ensure the hook always resolves to either ready or error without lingering generating state when text/canvas changes rapidly."
        },
        {
          "path": "frontend/src/components/share/ShareDialog.tsx",
          "operation": "modify",
          "description": "Ensure QR generation always uses the exact canonical URL from getShareUrl() as the encoded payload (no extra whitespace/formatting), and adjust QR rendering props (size/margin) as needed to align with the updated standards-compliant generator."
        },
        {
          "path": "frontend/src/pages/FlyerPage.tsx",
          "operation": "modify",
          "description": "Ensure the Flyer page QR generation uses the exact canonical URL from getShareUrl() as the encoded payload and align QR rendering props (size/margin) with the updated generator so exported/onscreen QR remains reliably scannable."
        },
        {
          "path": "frontend/docs/flyer-download-smoke-test.md",
          "operation": "modify",
          "description": "Extend the manual smoke-test checklist to include QR scan verification on iOS Camera and a typical Android camera QR scanner for both Share dialog QR and Flyer page QR, confirming it appears as a tappable URL and matches the displayed App Link."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Add clear English guidance and an obvious App Link fallback when QR is present but not scannable, without blaming the user’s phone and without introducing infinite loading.",
      "acceptanceCriteria": [
        "If QR generation fails or produces an unusable result, the UI provides an English message that recommends using “Copy Link” / the App Link field as the fallback.",
        "All new/updated messages in ShareDialog.tsx and FlyerPage.tsx remain in English and match the app’s existing safety-focused tone.",
        "No infinite loading state is introduced; the QR area must either reach a ready state or show an actionable error state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/share/ShareDialog.tsx",
          "operation": "modify",
          "description": "Update the QR area overlay and any toast/error text to provide clear, safety-focused English recovery guidance (e.g., suggest using the App Link field and the “Copy Link” action), and add a neutral tip for when the QR is visible but the camera doesn’t recognize it (without implying the user’s phone is at fault)."
        },
        {
          "path": "frontend/src/pages/FlyerPage.tsx",
          "operation": "modify",
          "description": "Adjust on-page QR status messaging to include an actionable fallback path (use the App Link + copy button) for both generation failures and “QR visible but not recognized” scenarios, while ensuring the QR section never remains in an indefinite generating state."
        },
        {
          "path": "frontend/src/components/share/FlyerPreview.tsx",
          "operation": "modify",
          "description": "Enhance the Flyer preview’s QR overlay text to include concise, English fallback guidance (e.g., “If scanning doesn’t work, use the link shown below”) while preserving the existing flyer layout and tone."
        }
      ]
    }
  ]
}