{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Grant admin access to specific Principal ID",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Ensure the admin authorization check correctly identifies the hardcoded Principal ID as an admin and grants access to the Admin Dashboard",
      "acceptanceCriteria": [
        "The useIsCallerAdmin hook returns true for the hardcoded Principal ID",
        "The Access Denied screen no longer appears for this Principal ID when accessing admin routes",
        "The Admin Dashboard page loads successfully for this Principal ID",
        "All admin features (user registrations, verification reviews, SOS locations, member directory, activity logs) are accessible"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the useIsCallerAdmin hook to call the backend isCallerAdmin() method and properly handle the response. Ensure proper error handling and loading states are returned. The backend has already been configured with the hardcoded admin Principal ID '2yscf-yuwfq-41ml4-t6ujy-r3ogj-ajbkj-rmiih-uyk25-o34ky-6jpe6-gae', so the frontend hook must correctly invoke the backend capability and return the authorization status."
        },
        {
          "path": "frontend/src/components/auth/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Review and verify that AdminRouteGuard correctly uses the useIsCallerAdmin hook to determine admin status. Ensure the loading state properly waits for both actor initialization and the admin check to complete before rendering AccessDeniedScreen. Add comprehensive console logging to debug authorization flow for the hardcoded Principal ID. The guard must allow access to /admin/* routes when isCallerAdmin returns true."
        },
        {
          "path": "frontend/src/components/layout/AppNav.tsx",
          "operation": "modify",
          "description": "Verify that the Admin Dashboard navigation link correctly uses the useIsCallerAdmin hook and displays for users with admin privileges. Ensure the navigation item appears immediately when the hardcoded Principal ID is detected as an admin."
        }
      ]
    }
  ]
}