{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Launch-ready sharing: client-side QR codes and canonical share URL",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Replace external QR Server dependency with fully client-side QR generation for Share dialog and Flyer QR codes, with graceful failure handling.",
      "acceptanceCriteria": [
        "Opening the Share dialog successfully renders a QR code without making any network request to https://api.qrserver.com (or any external QR generation service).",
        "Opening the Flyer page successfully renders a QR code without making any network request to https://api.qrserver.com (or any external QR generation service).",
        "If QR generation fails for any reason, the UI shows the existing English error toast (e.g., “Failed to generate QR code”) and the rest of the Share dialog/Flyer page remains usable (copy link, quick share where supported)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/qr.ts",
          "operation": "modify",
          "description": "Remove the QR Server API image-fetch approach and implement QR rendering fully client-side (canvas-based), preserving the existing generateQRCode(text, canvas, size) signature and throwing the same 'Failed to generate QR code' error on failure so existing toasts continue to work."
        },
        {
          "path": "frontend/src/components/share/ShareDialog.tsx",
          "operation": "modify",
          "description": "Ensure Share dialog QR generation uses the updated client-side generateQRCode implementation, does not rely on any external QR service, and keeps the dialog usable on failure (copy link / quick share remain enabled) while continuing to show the existing English error toast on QR failures."
        },
        {
          "path": "frontend/src/pages/FlyerPage.tsx",
          "operation": "modify",
          "description": "Ensure Flyer page QR generation uses the updated client-side generateQRCode implementation, does not rely on any external QR service, and keeps the page usable on failure (copy link / flyer export gating remains sensible) while continuing to show the existing English error toast on QR failures."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Standardize a canonical, absolute share URL used consistently across Share dialog and Flyer page.",
      "acceptanceCriteria": [
        "The value shown in the “App Link” field in the Share dialog matches the value shown in the “App Link” field on the Flyer page.",
        "The share URL is a valid, absolute URL that navigates a user to the app’s entry page when opened in a new browser session.",
        "All user-facing text related to sharing remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/shareUrl.ts",
          "operation": "modify",
          "description": "Update share URL generation to return the canonical, absolute public app entry URL (not a route-specific URL), preferring an explicit runtime config value when available and otherwise deriving a stable base URL from the current location; ensure the returned value is consistent (e.g., normalized trailing slash) across the app."
        },
        {
          "path": "frontend/src/components/share/ShareDialog.tsx",
          "operation": "modify",
          "description": "Ensure the 'App Link' field and all share/copy/quick-share actions use the canonical URL from getShareUrl() and remain English-only."
        },
        {
          "path": "frontend/src/pages/FlyerPage.tsx",
          "operation": "modify",
          "description": "Ensure the 'App Link' field and flyer QR/link display use the canonical URL from getShareUrl() and match the Share dialog exactly (same string normalization and formatting), with English-only user-facing sharing text preserved."
        }
      ]
    }
  ]
}